{
    "intents": [
        {
            "tag": "(0) How are you doing today? ",
            "patterns": [
                "  I don't know. I just feel lost and confused.",
                "  Oh hello, who are you? ",
                "  Will you come back and visit me again? It’s nice to have someone to talk to. ",
                "  Thank you for visiting me. It's nice to talk to someone.",
                "  (silence)",
                " Hobbies? Well, I used to love gardening and knitting. But now it's hard to remember how to do those things.",
                " Oh, hello dear. How are you? ",
                " Oh dear, I can't find my glasses. Have you seen them?",
                " Of course I know where I am! I'm at the grocery store. Can you help me pick out some apples?",
                " I'm feeling a little tired now. Thank you for visiting me today.",
                " ",
                "  Can you stay with me for a while?",
                "  Two, a son and a daughter.",
                " Who are you by the way?",
                " Hello there, who are you?"
            ],
            "repsonses": [
                "(0) How are you doing today? "
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "(1) Do you know where you are? ",
            "patterns": [
                " I'm not sure. It's all a blur.",
                "  Oh, not too bad, thank you for asking.",
                " That's right. I remember now.",
                "  Oh, hello! I'm doing well, thank you for asking.",
                " I'm doing alright, thank you for visiting me.",
                "  I'm not sure, dear. I can't seem to remember much.",
                "  Oh, hello there. I'm doing just fine, thank you.",
                " Oh, hello! I'm doing okay, I suppose. I don't remember what I did this morning though. ",
                " Oh, hello there! I'm doing just fine.",
                "  Oh, hello. Who are you?",
                "  I don't know where I am. Why is nobody telling me anything?",
                " Oh, hello! I'm doing well, thank you.",
                " How are you doing today? (0)",
                " Have you met my cat? He's around here somewhere.",
                " I don't know. Who are you?",
                " Oh, hello there! I'm doing fine, thank you for asking.",
                "  Oh, hello there! I'm doing alright, thank you for asking.",
                " Oh, I’m just fine. I’m waiting for my husband to come back from work.",
                "  I don't know. I think I might be lost.",
                "  Oh, hello! I'm feeling alright, thank you for asking.",
                " Oh hello there! I am doing fine, thank you for asking.",
                "  I don't know. Who are you?",
                "  Oh, hello! I'm doing fine, thank you for asking.",
                " Oh, hello! I'm doing alright, just a bit confused.",
                " Oh, I'm alright. Who are you again?",
                " Oh, not too bad, thank you for asking.",
                " Oh hello, I'm doing alright. How about you?",
                " Oh hello, dear! I'm feeling alright, thank you for asking.",
                " Oh, I'm just fine. Thank you for asking.",
                "  (long pause) Who are you?",
                "  Oh, I am? I don't remember feeling sick. But I suppose you must be right.",
                "  Oh, hello there. I'm okay, thank you for asking.",
                " Oh, hello there. I'm doing just fine, thank you for asking.",
                " Oh, hello there. I'm feeling okay, just a bit confused. ",
                "  Oh, hello! I'm doing well, thank you for asking.",
                "  I don't know, who are you?",
                " Oh, hello! I'm doing well, thank you for asking.",
                " Oh hello, I'm doing fine. Thank you for asking.",
                " Children? Oh, I have two wonderful children. They visit me here sometimes. I just wish I could remember their names.",
                " Oh, hello there. I'm doing just fine, thank you.",
                " Oh, hello. I'm not sure, dear. I can't seem to remember much.",
                " Fishing? Oh, I used to love fishing. We had so much fun on those trips.",
                "  Oh hello dear, I'm doing fine. It's so good to see you.",
                "  Oh hello there, I'm doing alright, thank you.",
                " Oh, hello! I'm doing well, thank you for asking.",
                " I'm doing well, thank you. Just a bit tired.",
                "  Oh, hello dear! I'm doing just fine, thank you for asking.",
                "  I'm doing okay, thank you.",
                "  Oh, hello there. I'm doing alright, thank you for asking.",
                "  Hmm, let me think. (20)",
                "  Oh hello there, I'm doing just fine.",
                " That's good to hear. How has life been treating you lately?",
                " Yes, I'm very scared. I don't know what's going on.",
                " Oh, hello dear! I'm doing just fine. Thank you for asking.",
                " I am sick? I don't remember being sick. ",
                " I don't know, dear. Where is my husband? He should be here by now.",
                " Oh, hello dear. I'm doing alright, I suppose.",
                " Oh, I don't know. I think I'm lost.",
                "  Who are you? ",
                "  I'm doing okay, I guess. Just a little confused.",
                "  No, I don't remember. ",
                " (stares blankly)",
                " Oh, hello! I'm doing pretty well, thank you.",
                "  Oh hi, who are you?",
                "  Oh, hello there! I'm doing fine, thank you.",
                " Oh, I'm doing fine. How about you?",
                " Oh, hello there! I am doing quite well, thank you for asking.",
                " Oh, hello dear. I'm doing fine, thank you for asking.",
                " I'm doing okay, thank you.",
                "  I don't know. I think I'm lost.",
                "  Not too good, I don't know where I am.",
                "  Oh hello, I'm doing just fine. How are you?",
                "  I'm doing okay. I don't remember what I did yesterday though.",
                "  Oh, hello there! I'm doing well, thank you for asking.",
                " Who are you? What are you doing here?",
                "  Sick? I don't feel sick.",
                "  Oh, hello dear. I'm not sure, how are you?",
                "  I don't know dear, I just feel like something is not quite right. I'm not sure what it is though.",
                " Oh yes! That was such a wonderful time. We had so much fun.",
                "  Oh, hello there. I am doing alright. ",
                "  I'm doing alright, thank you. How are you?",
                "Dimentia  I don't know. Who are you?",
                "  (Silence)",
                " Yes, I suppose so. I don't really know what's going on.",
                " Oh, hello! How nice to see you. I'm doing just fine, thank you for asking.",
                "  Oh, hello there. I'm feeling a bit lost. ",
                "  I must say, this hospital is quite lovely. Have you seen the gardens outside?",
                "  Oh, I'm doing fine, thank you for asking.",
                "  Oh, hello. I'm doing pretty well, thank you for asking.",
                " Oh, hello! I'm doing alright, thank you for asking.",
                " I don't know. I feel like something is off.",
                " Who are you? ",
                " ",
                " I'm doing okay, thank you for asking.",
                " Who are you? ",
                " Oh hello! I'm doing alright, thanks for asking.",
                " Oh, hi there. I'm doing okay, thank you for asking.",
                " Oh hello, I'm doing well, thank you for asking.",
                " Oh hello, I'm doing alright today. Thank you for visiting me.",
                " Oh, hello dear! I'm doing alright, thank you for asking.",
                " Oh, hello there. I'm doing fine, thank you for asking.",
                "  I'm doing alright. How are you?",
                " Oh, hello there. I'm doing okay, thank you for asking.",
                " Oh, hello there. I'm doing well, thank you.",
                " I don't know, who are you? ",
                "Grandma: Oh hello dear, I'm doing alright. How are you?",
                " I'm feeling a bit confused.",
                " Oh hello there! I'm doing fine, thank you for asking.",
                " Who are you? ",
                " Oh, hello there. I'm doing well, thank you.",
                "  Oh hello dear, I'm doing well, thank you for visiting me.",
                " Oh, hello there. I'm doing just fine, thank you for asking.",
                "  Oh hello! I'm doing well, thank you for asking.",
                "  I'm doing alright, I think.",
                "  Yes! We had so much fun. The water was so chilly, but we still went swimming.",
                " Oh, hello there. I'm just a bit confused. ",
                " Oh, hello! I'm feeling a little lost right now. ",
                " Oh, hello there. I'm doing alright, thank you.",
                "  Yes, a little. I don't know where I am or what's happening most of the time.",
                "  Oh, hello there! I'm doing just fine, thank you for asking.",
                "Grandma: Of course, you're my beautiful granddaughter. I remember when you were just a little girl and we would bake cookies together. You always loved the ones with the sprinkles.",
                " I'm doing alright, thank you for asking. ",
                " I don't know... who are you? ",
                " Oh, hello! I'm doing just fine, thank you.",
                "  I don't remember being sick. Can you take me home?",
                "  Oh, I am not sure. I think I am lost.",
                " Oh, hello! I'm doing just fine, thank you. How about you?",
                " I'm doing alright, thank you for asking.",
                " Oh, hello! I'm doing well, thank you for asking.",
                "  Oh, hello there. Did you see the birds outside earlier?",
                " Oh, hello. I'm doing fine, thank you.",
                " Oh, hello! I'm doing well, thank you for asking. "
            ],
            "repsonses": [
                "(1) Do you know where you are? "
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "(2) Do you know what year it is? ",
            "patterns": [
                " Yes, I'm in the hospital.",
                "  That's right, thank you for reminding me.",
                "  Oh good, I'm glad to hear that. How has everything been for you lately? ",
                " Oh, that's right. Thank you for reminding me. ",
                "  I love fall. ",
                " You're in the hospital. (14)",
                " My children are all grown up now. I have three of them, two boys and a girl.",
                " Oh, I see.",
                " Sick? What's wrong with me?",
                "  Oh, that's right. Thank you for reminding me.",
                " Yes, I am in a hospital.",
                "  Right, right. I remember now.",
                " Oh? I must have forgotten.",
                "  I think I'm in school.",
                "  Oh, right. Sorry. Sometimes my memory isn't what it used to be.",
                " Oh, that's right. Thank you.",
                " No, I don't remember. Why am I here?",
                "  Oh, okay. Thank you.",
                " That's great. Today is November 3rd. (11)",
                " St. Mary's? Oh, yes, of course. How silly of me to forget.",
                "  Oh, I see. I don't remember feeling sick, though.",
                "  I used to love gardening. (20)",
                "  Yes, I remember! We had so much fun collecting seashells on the sand.",
                " Oh, that's right. Thank you for reminding me.",
                " Baked cookies? Oh yes, I remember that. We used to make the best chocolate chip cookies, didn't we?",
                " Yes, of course. I'm at the hospital, dear.",
                " Yes, it was so much fun. We built sandcastles and swam in the ocean. I wish we could go back there again.",
                " Oh! That's right. Thank you. ",
                "  I think I'm in a hospital.",
                " Really? I feel perfectly fine. I just want to go home and see my daughters.",
                "  Oh, I see. I hope I get better soon.",
                " Hospital? No, I don't remember.",
                "  Hmm, I don't think I've ever been here before.",
                "  Really? That seems so far away.",
                "  Oh, hello dear. I'm doing alright. Just a bit tired.",
                " I live in the same place I've always lived.",
                "  I think I'm in a hospital, but I'm not sure which one.",
                "Dimentia  Oh, that's right. I remember now.",
                "  Yes, I loved growing roses in my garden.",
                "  Am I? I don't remember feeling sick. ",
                "  I have three children, two boys and a girl. They're all grown up now, with children of their own. I'm so proud of them.",
                "  Oh, okay. Thank you for letting me know.",
                " Ah yes, that's right. Thank you for reminding me.",
                " So, do you have any news for me?",
                "  Oh, that's very helpful. Thank you.",
                " Yes, I'm in a hospital.",
                " No, I don't remember.",
                " Yes, I remember now. My spouse's name is John.",
                " Oh, I see. Thank you for letting me know.",
                " Oh, okay. Thank you for letting me know.",
                " Oh, thank you for letting me know.",
                " Oh, I see.",
                "  Oh, yes! I remember that. It was so much fun.",
                " You're here because you're sick, Grandma. (15)",
                " Oh that must be it. I hope I get better soon.",
                " No, I don't. ",
                " Yes, I'm in a hospital.",
                "  Yes, I'm in the hospital.",
                " What? Today is already Tuesday? Time really flies, doesn't it? ",
                " (pauses) I can't seem to remember...somewhere nearby, I think. ",
                " Oh, that's right. Thank you for reminding me.",
                " Oh, I love to read and crochet. It keeps me busy and my mind active.",
                " Hmm, I'm not quite sure. My memory is a bit fuzzy.",
                " I don't know.. ",
                " Yes, I'm in my room."
            ],
            "repsonses": [
                "(2) Do you know what year it is? "
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "(3) Do you know what season it is? ",
            "patterns": [
                " Yes, I do. It's been harder for me lately, though.",
                "  Wow, time flies. ",
                " Oh, really? I had no idea.",
                "  I used to like crosswords and gardening. But I can't do either of those now. ",
                "  Oh, my goodness. I had no idea it was that late!",
                "(Several more minutes pass)",
                "  Oh my, wow, has it really been that long? ",
                " I'm scared because I don't remember anything. It's like my mind is playing tricks on me.",
                " That's quite different from what I remember. Everything is so confusing now.",
                " Sick? I don't remember being sick.",
                "  Oh, the beach! I love the beach.",
                " Oh, wow. I didn't realize it was that long ago. ",
                " My, how time flies!",
                "  No, I'm not scared. But I do feel a bit confused and disoriented.",
                "  No, I don't remember that.",
                "  Oh, I loved gardening when I was younger. I always had the prettiest flowers.",
                " Oh my! Time flies by so quickly.",
                "  Oh wow, I'm really behind then!",
                "  Oh, I see. Thank you for telling me. ",
                " Oh, not too bad. The weather is nice.",
                " Oh, is that so? I can't seem to remember why I'm sick...",
                "  (shakes head) I don't remember.",
                "  Ah, thank you! My memory isn't what it used to be.",
                "  I don't think I'm scared, just a bit confused.",
                " My goodness, time really does fly, doesn't it?",
                " Hobbies? Well, I used to love gardening and knitting, but I don't do them much anymore. ",
                " No, I don't remember. What year is it?",
                " It was a beautiful summer day. I miss those days.",
                " Honestly, I'm not sure. Everything seems a bit fuzzy.",
                " Really? What season is it?",
                " Well, I used to love woodworking. I made so many beautiful things in my time.",
                "  Oh my, time flies doesn't it?",
                "  Ah yes, that's right. I remember being brought here.",
                " Oh, I see. I hope it's nothing serious.",
                " It is 2021. (12)",
                " 2021? That can't be right. I feel like it should still be the seventies.",
                " The beach... Yes, I remember. The waves were so beautiful. ",
                "  Not really, I'm just a bit confused and unsure about what's going on.",
                " My, my... time really does fly, doesn't it?",
                " I used to like painting and going for walks. ",
                " Oh, I have three beautiful children. Where are they now?",
                " Is it really? My, how time flies.",
                "  August? Is it summer? ",
                "  I don't know. ",
                " Oh, that's right. I remember now. Thank you.",
                " Oh, I see. I don't like hospitals.",
                " Oh, my! That seems like so long ago...",
                "  Hmm...I'm not sure.",
                " Is it really? I didn't realize. Time flies when you're having fun, doesn't it?",
                " Yes, it is.",
                "  I just can't seem to remember anything lately. It's all so confusing.",
                "  Scared? Why would I be scared? Is there something wrong?",
                " I don't know. I just feel like something isn't right.",
                "  I'm not quite sure. Is it 1955?",
                "  Oh, okay. It's hard to keep track sometimes. ",
                "  Oh my, that long? Time certainly flies.",
                " Oh my, I can't believe it's already that far into the future!",
                "  His name was John. He was kind and funny. I miss him.",
                " Hobbies? I used to love gardening and painting.",
                " Hmm, I'm not sure. ",
                " Oh, I love reading! Although I find it hard to remember what I've read sometimes.",
                "  I'm not sure... I just feel like something's not right.",
                " Oh, that's right. I sometimes forget these things.",
                " Oh, I see. Thank you. ",
                " I don't feel scared, but I do feel a bit confused and disoriented.",
                " Oh my, that's quite a difference.",
                " Wow, time has really flown by, hasn't it?",
                " Oh my, I had no idea it was that far ahead. Time really does fly by.",
                " Oh, how time flies.",
                "  I don't know. I feel dizzy and confused all the time.",
                " Oh, I see. I don't feel too sick though, just a bit confused. ",
                " 2021? That seems like a long time ago. ",
                " It is the year 2021, Grandma. (12)",
                " Okay, thanks for letting me know.",
                " No, Mom. It is much later than that. It is 2021. Today is January 30th. (11, 12)",
                " Oh my, has it been that long already?",
                "  That's good to hear, I don't remember being sick though.",
                "  Oh my, time really flies.",
                " I'm not sure. I'm just so confused.",
                " Oh, yes, that's right. Thank you for reminding me. ",
                " My, how time flies. I can't believe it's already 2021.",
                " It's actually the year 2021. (12)",
                " Tuesday? August 24th? That can't be right. It feels like it was just yesterday when it was Christmas.",
                "  That seems like a long time ago.",
                " <looking confused> No, I'm sorry. I can't quite remember.",
                " I don't know, everything feels so confusing.",
                " June? Already? Where did the time go?",
                "  Is it really? I didn't realize it was that late in the year already.",
                " 2021? My goodness, time flies."
            ],
            "repsonses": [
                "(3) Do you know what season it is? "
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "(4) Do you remember the time when <insert pleasant memory cue>?",
            "patterns": [
                " Oh, okay. Thank you for telling me.",
                "  No, not scared. Just a bit confused, I suppose.",
                "  Oh, I don't remember being sick.",
                " I have three children. All grown up now. They used to be so little and cute.",
                "  Yes, I am. I don't understand what's happening to me. ",
                "  Thank you for telling me.",
                " I remember having a son and a daughter, but I can't recall their names or where they are now.",
                "(Several minutes pass)",
                "  Ah, yes, I thought so. I always loved this time of year.",
                " Did you bring any cookies? I used to love baking cookies with my grandmother.",
                "  Yes, I am. I've never been good with hospitals. Please stay with me.",
                " Oh, is it really? I can't even tell. ",
                " I have two children, a son and a daughter. They are both grown now, I think.",
                "  I can’t seem to remember anything these days.",
                "  I used to love knitting.",
                " Hmm... I used to love knitting. ",
                "  Not really. I just feel confused sometimes. (20)",
                "  I'm not sure. Can you remind me? (20)",
                "  I just need someone to talk to. Do you remember the time when we went on that trip to the beach?",
                " Yes, a little bit. There are so many people around here.",
                " Yes, I love to read.",
                " Oh, yes! I remember that trip vividly. We had so much fun, didn't we?",
                " It feels quite warm outside, so I think it might be summer.",
                "  February 5th...that doesn't ring any bells. ",
                " Oh, I see. ",
                " Do you know if John is here yet? ",
                "  I don't remember anything.",
                "  I used to enjoy knitting.",
                "  Right, thank you.",
                " I think it's winter.",
                "  They were such wonderful children. Always making me proud.",
                "  Okay, yes. That makes sense.",
                "  I'm not quite sure. Is it winter?",
                " I just feel disoriented and confused. It's scary not knowing what's happening.",
                " I'm not sure. Would you like to hear about a funny story from when my children were young?",
                " Oh, really? No wonder it's so cold!",
                " Ah, summer. I used to love going to the beach with my family during the summer. Do you remember the time when we all went to the beach together?",
                " Oh...I guess I was wrong.",
                "  Is it winter?",
                "  Yes, I feel scared and alone.",
                "  Ah, fall. I used to love going for walks in the park during the fall. The leaves turning all those beautiful colors...",
                " That's great! Do you remember when we used to go on picnics together by the lake?",
                "  Is it summer? I remember loving summers when I was young.",
                " I used to love gardening, but I can't remember the last time I did it.",
                " Children? Oh, I have children. How many...I'm not sure. ",
                "  I just feel a little confused and disoriented. It's scary not knowing what's happening.",
                "  I don't remember.",
                " Hmm, well, it's good to be taken care of. Thank you for being here with me.",
                " I used to love gardening and reading books. But I can't seem to find the time for it anymore.",
                " I don't feel scared, just confused. I don't remember much.",
                " I'm just so confused all the time, and I don't know why. It's scary not being able to remember anything.",
                " Sick? I don’t remember being sick.",
                " They're all doing well. Very successful in their own ways.",
                " Yes, my wife's name is Mary. She's a lovely woman.",
                "  Really? It doesn't feel like it.",
                " Winter? Oh, how lovely. I always loved the snow.",
                "  I don't remember much. But I remember they were all very smart.",
                " Well, I used to love gardening and baking. But I don't have the energy for that anymore.",
                " Summer? I love summer. I used to go on vacations with my family in the summer.",
                "  Oh, I have three wonderful children. Let's see... There's Sarah, and John, and... Oh dear, I'm afraid I can't remember the name of my youngest child. But they're all doing well, I'm sure of it.",
                "  I don't remember anything anymore. It's like my memories are slipping away.",
                " Yes, I love reading. ",
                "  Who are you?",
                "  I don't feel sick. Where is my husband? (6)",
                "  Oh, okay. Thank you for letting me know.",
                " I really miss my family. Are they coming to visit soon?",
                " Oh my, I had no idea. Thank you for telling me.",
                " Oh, okay. How did I get here? ",
                "  I just feel confused and lost.",
                " I'm feeling a bit confused. I thought I was supposed to be meeting my sister for tea, but I can't seem to remember where she lives.",
                " Oh, how lovely.",
                " I don't remember. Maybe three?",
                "  I always loved summer. ",
                "  Can you stay with me for a little while? I don't want to be alone.",
                "  Oh, okay. ",
                " Yes, I used to collect stamps.",
                " Wow, time really flies, doesn't it?",
                " Oh, I love playing Moon River. It's such a beautiful song.",
                "  I know I have children, but I can't seem to remember anything about them.",
                "  No, I'm not scared. But I feel like I'm forgetting something important.",
                " I have two children. A boy and a girl. They are both so wonderful.",
                " My children? Ah, they were all so wonderful. Such good kids. We used to have so much fun together.",
                " My children? Oh, they are wonderful. I have two sons and a daughter. They are all grown up now and have families of their own.",
                " I don't know why I'm here. I don't remember anything.",
                "  I don't feel scared, but I'm confused. I don't remember anything.",
                " My children? Where do I even begin? They are all so wonderful and accomplished. I'm very proud of them.",
                "  Summer, ah yes. I remember going to the beach with my family during summer. Do you remember that time?",
                "  Yes, my husband's name is John. He's such a great man.",
                "  Is it winter?",
                " I have two lovely daughters, Mary and Jane. They're both nurses, you know. Very smart girls.",
                "  Wow, time really flies doesn't it?",
                " I used to love gardening and cooking, but I don't do those things anymore.",
                "  Oh, I see. I guess I lose track of time sometimes.",
                " Do you know what's wrong with me?",
                "  Summer... I used to love to go swimming in the lake during summer. ",
                "  Do you remember when we used to go fishing together?",
                "  Yes, I don’t like feeling like this.",
                " Oh, I don't know. I just feel confused.",
                "  Oh my, time just flies by.",
                "  I used to love knitting and painting, but I haven't done them in a long time. ",
                " Oh yes, I love to read. I have a whole library at home.",
                " No, not scared. Just a little confused. ",
                " You know, I was just thinking about the day I met my husband. It was a beautiful day in June, and we went for a walk in the park.",
                " That long? I have trouble remembering what I did yesterday.",
                " Oh, yes! I love to read. Do you have any good books you could bring me?",
                "  I'm not sure, but it feels like it might be winter.",
                "Dimentia  I'm sorry, I don't know.",
                "  Yes, I love to garden.",
                "  Yes, I used to love to read.",
                " Oh, I see. I don't remember being sick.",
                " He used to take me dancing every Friday night. We had so much fun!",
                "  Sick? Oh no, that doesn't sound good. Do you remember the time when we went on a picnic?",
                "  That's right. I always loved the colors of fall. ",
                "  Oh, I see. Do you remember when we went on that family vacation to Hawaii?",
                "  Oh, I don't know. I feel a bit confused sometimes, but overall I'm doing alright.",
                " Winter? I must have missed Christmas. Do you remember the time when our family would gather at my house for the holidays?",
                "  Yes, his name is John. We've been married for 50 years, you know.",
                "  Oh, it's fall then. I always loved walking in the leaves during autumn.",
                " I miss them so much.",
                " Yes, I always loved the colors of the changing leaves during this time.",
                "  Oh, okay. Thank you for telling me.",
                " Oh, I have two. A son and a daughter.",
                " Is it summer?",
                " I suppose I am a little bit scared, now that you mention it. But not to worry, I always try to keep positive.",
                " Oh, that's good to hear. Do you remember when we used to go to the park together?",
                "  Oh, I used to love going to the beach in the summer.",
                "  I used to love playing piano and gardening.",
                "  I used to have a best friend named Sarah. We would play hopscotch and have picnics.",
                " Really? I must have lost track of time.",
                " I'm not sure. Is it fall yet?",
                " I don't remember much about them anymore. It's been so long.",
                " I see. I don't really remember how I got here.",
                " Oh, I must be mistaken. Thank you for telling me.",
                "  I miss them so much. I wish they could come visit me more often.",
                " I don't think I'm scared, but I'm definitely confused. I don't know what's happening to me.",
                " Oh, I see. I always loved the warmth of the sun.",
                " Well, one is a doctor and the other is a teacher. They're both making such an impact on the world.",
                " Interesting!",
                "  Did I tell you about the time we went to the beach and built sandcastles?",
                " Oh, I see. Spring is nice too, I used to love seeing all the flowers bloom. ",
                " I don't know, I just feel lost and confused. ",
                "  I don't know, I don't remember.",
                " Yes, it's summer right now. (13)",
                " Oh, okay.",
                " Oh, it's summer then!",
                " Oh my, time flies. Do you know what season it is? (3)",
                "  I don’t remember.",
                " Winter? That's right, I should have known.",
                "  Summer? That means it's time for trips to the beach! Do you remember the time when we went to the beach with the kids?",
                "  Yes, I am. Do you remember the time when we went to the beach? It was such a lovely day.",
                " 2021? That can't be right, it feels like it was just yesterday that I was a child.",
                "  Do you remember when we used to go to the beach every summer?",
                "  I used to love summer, playing outside with my children.",
                " Oh, okay. Thank you for letting me know. (pauses) Do you remember when we used to go on picnics in the park?",
                "  Oh, hello! Who are you?",
                " I feel like I should know you. Have we met before? ",
                " Oh, really? Well then, I must have lost track of time. ",
                " A little bit, I suppose. But I'm mostly just confused.",
                " Do you remember when we used to go fishing in the lake near our house? It was always so much fun.",
                "  Oh, is it already that time of the year? I can't seem to keep track of time anymore.",
                "Grandma: Oh, hello dear, it's so good to see you! Wait, who are you?",
                "Grandma: I'm sorry, I can't remember. Will he be coming to visit me soon?",
                " I used to live in the city, but I can't remember where now. ",
                " I used to love knitting and gardening.",
                " Hobbies? Oh, I used to love playing the piano. And gardening, too. But I haven't done those things in a long time.",
                "  That's what I thought.",
                "  Autumn? That means my birthday is coming soon.",
                " I used to enjoy gardening and cooking, but I haven't done much of it lately.",
                " My daughter is a teacher and my son is a lawyer.",
                " Ah, that's right. My favorite season.",
                " Yes, I am. ",
                " I think it might be spring. I love spring, don't you?",
                " I'm feeling a bit confused actually, and a little scared. Everything seems so unfamiliar to me."
            ],
            "repsonses": [
                "(4) Do you remember the time when <insert pleasant memory cue>?"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "(5) How many children do you have?",
            "patterns": [
                "  I have three children. Two boys and a girl. They're all grown up now.",
                " Do you know when my children will be here?",
                "  Oh, I have three children. Sarah, Michael, and David. They're all grown up now. ",
                " Do I have any children?",
                "  Yes, it's a scary place to be in, but I'm grateful for your company. ",
                " I have two children. A boy and a girl. Their names are John and Mary. They used to come visit me all the time.",
                "  My children? Oh, I have...I have two, I think. A son and a daughter. They are both so dear to me.",
                " I have children? Oh my goodness, I can't seem to remember anything like that.",
                " I have children? Oh, yes, I do! Let me see, there's... umm...",
                "  Children? How many children do I have?",
                "  Do I have any children?",
                " Oh, yes! That was such a fun project. ",
                "  My children? I have two daughters. They are both grown now.",
                " I have three children. John, Sarah, and Michael.",
                " Well, sometimes I do feel a little confused, but otherwise, I'm doing alright.",
                "  I have two daughters and a son. They are all grown up now and have children of their own.",
                " My wife... Her name is Sarah.",
                " Children? Oh, I have three. Two boys and a girl.",
                "  How many children do I have?",
                "  Why yes, I do! I remember the sun being so warm.",
                " Yes, it was such a lovely day.",
                "  Do I have any children?",
                "  Oh, I have two children. A son and a daughter. They're both grown up now.",
                "  Yes, I remember going to the beach with my family. We had so much fun.",
                " I have children? How many do I have?",
                " I have four children. Two boys and two girls. They're all grown up now.",
                " Yes, I'm in my bed. But I don't know where my house is.",
                " Is it already July? Time sure flies by.",
                " Yes, I'm in the hospital. I don't know why I'm here though.",
                " My children? I have children?... How many? What are their names?",
                " I have two children, a son and a daughter. Their names are Mark and Emily.",
                "  (smiles) Yes, I loved those times.",
                " Is it already? Time flies, doesn't it?",
                " Do you have any children? How many do you have?",
                "  I have children? How many do I have?",
                " Ah, the colors outside must be simply beautiful then.",
                " How many children do I have? ",
                "  I have children?",
                " Oh, I remember that! It was such a wonderful time. Thank you for reminding me of it.",
                " Oh yes, I remember that! We used to have so much fun together.",
                " Children? Oh, I have a few of those. Let's see...there's Sarah, Michael, and...I can't quite remember the others.",
                " I have children? How many do I have?",
                " I have two children, a boy and a girl. They are both all grown up now though.",
                " Do you know who I am?",
                " Oh, not too bad. I've been better.",
                "  Oh yes, those were lovely days. I miss them.",
                "  My children? Oh dear, I'm not quite sure. Could you remind me of their names?",
                "  Yes, his name is John.",
                " I have two children, a boy and a girl. They are both grown now.",
                "  I...I just don't know what's happening. It's all so jumbled up in my head.",
                " Yes, it is summer now. Today is July 12, 2021. (11) It is the year 2021. (12) ",
                "  Yes, he was a good man. (20)",
                "  I love to knit and make blankets for my grandchildren.",
                " I have two children, a boy and a girl. They're all grown up now.",
                " Ah, well that makes sense. Everything does seem so different now.",
                " Yes, I remember that. It was a good time. ",
                "  Do I have any children?",
                " It must be 1950, because I was just dancing with my high school sweetheart.",
                " Oh, I do! We had such a grand time, didn't we?",
                " I have two children. A boy and a girl.",
                "  The beach? I don't remember that. ",
                "  I have children? How many do I have?",
                "  I used to enjoy knitting. ",
                " (smiles) Yes! It was beautiful.",
                " (pauses) I...I think I do.",
                " Oh, that's right. Thank you for reminding me.",
                "  How many children do I have?",
                "  I have children? How many do I have?",
                " (20) Mhhm. It feels quite warm outside, so I would say it's summertime!",
                "  I have children? How many do I have?",
                " Hmm, I can't seem to remember. Do I have any children?",
                "  Yes, I do remember that. We had a great time. How many children do I have again?",
                "  Oh no, not at all. I'm feeling really good actually.",
                "  Oh, I loved going to the beach. We always had so much fun.",
                " Oh yes, I remember that. We used to make the best lemon tarts.",
                "  Fishing? Yes, I remember going fishing with my dad when I was young.",
                " Children? I don't have any children.",
                "  I have two kids, but I can’t remember their names.",
                "  I have two children. A boy and a girl. They are both grown up now. ",
                " I have children? How many do I have?",
                " I have children? How many do I have?",
                " I have children? I don't remember having any children.",
                "  Oh, yes! I remember that. It was so much fun.",
                "Dimentia  Yes, I remember that! We had so much fun.",
                "  Oh, wow.",
                " I have two children, a boy and a girl. They are such wonderful kids. What are their names again?",
                "  Wow, that's a big number. Time really does fly by. Do I have any children?",
                "  Sometimes I feel like I'm in a dream. And I can't quite remember how to get back to reality. ",
                "  Oh, I see. Do I have any children?",
                " Yes, those were lovely. I can't seem to remember much else these days. Do I have any children?",
                "  I miss my children. How many do I have again?",
                " Children? How many do I have?",
                " Hmm, give me a moment... Oh! Yes, I remember when my grandkids would come over and we would bake cookies together.",
                "  Hobbies? Oh, I used to like gardening and painting. Do you like to do those things?",
                " I have children? How many do I have?",
                " I'm not quite sure. Can you remind me?",
                " Oh, I remember going to the beach with my family. We had a lot of fun. ",
                "  I have children? How many do I have?",
                " Oh yes, I remember that. It was such a lovely day.",
                " Yes, I loved that. We would always get hot cocoa afterwards.",
                " Oh, okay. Do you have any kids?",
                " I have children? How many do I have?",
                " I have three children, all grown up now. They are wonderful people.",
                " That's right! You're so good at this game. Tell me, do I have any children?",
                " Yes, of course. We had such a lovely time together. I miss those days.",
                " Oh, how lovely. I used to enjoy the changing of the leaves in the fall.",
                " I have three beautiful children. Two sons and a daughter.",
                "  I have three children. Sarah, David, and...I can't remember the third one.",
                " Oh, yes! I remember the beach. I used to love going there when I was younger. ",
                " I have two children. A boy and a girl. They were so little when they were born.",
                " Children? Oh, I have two wonderful kids. What are their names again? ",
                "  What are you doing here? Are you my daughter?",
                " Yes, that was so much fun. You always loved the beach. (20)",
                " Yes, I do! It was so much fun.",
                " Yes, it is winter. Do you remember the time when we went on our family vacation to the beach? (4)",
                "  Do I have any children?",
                " Oh yes, I remember that. It was so much fun.",
                "  I have two lovely children, a son and a daughter. ",
                "  Oh yes, those were such happy memories. How many children do I have again?",
                "  Yes, those were the best times.",
                " My daughter? I have a daughter? How many children do I have?",
                " (smiling) Ah, my children. I have three wonderful children. ",
                " I have children? How many do I have?",
                "  I have children? How many? What are their names?",
                "  Yes! We had so much fun building sandcastles and swimming in the ocean. It was a beautiful day.",
                " He passed away a few years ago, Grandma. Do you remember that? (4)",
                " I used to enjoy gardening and reading, but I don't do much of that anymore. ",
                " I have three children, two boys and a girl. They are all grown-ups now.",
                " The beach? Oh yes, yes I do! That was such a lovely day. The sun was so warm and the water was so clear.",
                "  I have two children. A son and a daughter.",
                " <smiling> Oh yes! I remember building sandcastles and watching the sunset with everyone. It was such a lovely trip.",
                " Oh, okay. ",
                " Children? How many children do I have?",
                " I have children? How many do I have?",
                " Ah yes, that was a wonderful day. The sun was shining and the waves were so calming.",
                " It's all getting a bit fuzzy now, though. I don't remember their names or where they are. Can you remind me? "
            ],
            "repsonses": [
                "(5) How many children do you have?"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "(6) Do you have a spouse? What is their name? ",
            "patterns": [
                "  Children? Oh, I have three lovely children. They're all grown up now, of course. ",
                "  I feel scared. Where's my spouse?",
                " Do you know where my husband is?",
                "  I miss my husband. Is he coming to see me soon? ",
                "(Another short pause)",
                " That's what I thought. I used to love the snow. Did you know I went skiing once with my husband?",
                " August 7th... hmm, that doesn't ring a bell.",
                "  Do you know when my husband is going to visit me?",
                " Hmm, let me think. I believe I have two children.",
                " The beach? Oh yes, I do remember that! We had so much fun.",
                " Three, two boys and a girl.",
                "  I don't remember their names.",
                "  Let me think... I believe I have two children.",
                " Oh, I have two wonderful children. They are so dear to my heart.",
                "  Like I said, I have two children.",
                "  I have two children, a daughter and a son. They are both grown up now.",
                " Three, I think. Two boys and a girl.",
                " I remember my wedding day. It was so beautiful.",
                "  I have four children.",
                "  Do you know my husband's name?",
                " Do I have a spouse? What is their name?",
                " Sick? I don't remember being sick. ",
                " I have two children; a son and a daughter. They are both grown up now.",
                " November 1st? That means it's almost time for Thanksgiving!",
                " Hmm, I don’t remember off the top of my head. Maybe six?",
                " I have three children, two boys and a girl.",
                " My children? Oh, they are the light of my life. I have two sons and a daughter, and they are all so wonderful.",
                "  Oh, okay. Do you know where my husband is?",
                " You are in the hospital because you are sick. (15)",
                "  Yes, I have three. Two boys and a girl. (20)",
                " Well, my oldest is a doctor, the middle child is a musician, and my youngest is a teacher. They're all so talented.",
                "  I remember having a son and a daughter, but I can't remember their names.",
                " It's definitely summer, because I can hear the ice cream truck outside.",
                " My children? Oh my, they're all grown up now. I remember when they were just little ones running around the house.",
                "  I have two, a boy and a girl. ",
                "  John, Sarah, and Michael. ",
                " I have two children, a son and a daughter. They are both grown up now. ",
                "  Ah yes. And do I have a spouse?",
                "  I have two children, a son and a daughter. They're such lovely kids.",
                "  I have two children, a daughter and a son. What are their names again?",
                " I used to love reading, but it's hard for me to concentrate these days.",
                "  I have two children, a boy and a girl.",
                "  Two.",
                "  Oh yes, I remember that! We used to have so much fun together. ",
                " I'm not sure. Can you tell me?",
                " Yes! His name was John and he had the most beautiful smile.",
                "  Of course I have children! I have two beautiful children.",
                "  Yes, I have two.",
                " Is my husband here with me?",
                "  Yes, it was so beautiful there. Do you have a spouse?",
                " Oh, they were wonderful. I remember them being so kind and thoughtful. I just wish I could remember their names. Do I have a spouse?",
                "  Do you know where my husband is? I haven't seen him in a while.",
                "  Oh yes, I remember when my husband and I first got married. It was a beautiful summer day and we had a picnic in the park. I miss him dearly.",
                "  I remember the time when my husband and I went on a trip to Europe. It was beautiful.",
                " I have two kids. John and Kate. ",
                " Scared? No, I'm not scared. Why would I be scared?",
                "  I have two children. A son and a daughter.",
                " I have two children, a son and a daughter.",
                " I have two boys and a girl.",
                " Ah, I see. What are their names?",
                "  Do you know where my husband is?",
                " As I just said, I have three wonderful children.",
                " You have two children, Mom and Dad. (18)",
                " I have two, a boy and a girl.",
                " Oh, that was such a wonderful time. We all had so much fun together. How many children do I have? (5)",
                "  Do you know where my wife is?",
                " I have two children, a boy and a girl.",
                "  Ah yes, that's right. And do I have a spouse?",
                "  Two, a son and a daughter.",
                " Knitting? I don't think I ever learned how to knit, but it sounds like a nice hobby. (pauses) Do you know where my husband is? Is he with me?",
                "  I have children? Oh, yes! I have two wonderful children. One is a doctor and the other is a teacher.",
                " Oh, I have two lovely children. A daughter and a son. But I can't seem to remember their names right now.",
                " It was such a lovely day. ",
                "Grandma: Oh, is that why I'm wearing this funny gown? I don't like it.",
                " Children? Hmm, let me think. I have two children, a son and a daughter. They're both all grown up now.",
                " <pauses> I have two children, don't I?",
                "  I'm not sure, but I think it might be spring. The flowers outside smell lovely.",
                " I don't know.. ",
                " Oh, I have two children. A son and a daughter. They're both so kind and loving."
            ],
            "repsonses": [
                "(6) Do you have a spouse? What is their name? "
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "(7) Where do you live? ",
            "patterns": [
                "(Several more minutes pass)",
                "  Two. A boy and a girl.",
                " Yes, my husband's name is John.",
                "  I don't know. I just want to go home.",
                "  I just want to go home.",
                " Yes, his name is John. He was such a handsome man.",
                " Yes, her name is Mary. She's such a beautiful woman.",
                " Two, a boy and a girl. They must be all grown up now.",
                " I have two children, a girl and a boy.",
                "  Her name was Mary.",
                " Yes, I have a husband. His name is John.",
                " Sick? I don't remember being sick.",
                " I don't know. I feel lost. ",
                " Yes, I do. His name is <insert name>.",
                " Why yes, I do. His name is Robert. Such a handsome fellow he was.",
                "  Yes, my husband. His name is John. ",
                "  Where do I live?",
                "  John, John. Yes, I remember now. Where do we live again?",
                "  Yes, I had a husband but I don't remember his name.",
                " It's springtime, isn't it? Look at all the flowers outside. Everything is so green!",
                "  (looking around) This isn't my home, is it?",
                "  I was married, but I can’t remember my spouse’s name.",
                " I don't know. I just want to go home.",
                "  Yes, I have a husband. His name is <insert name>.",
                "  Oh my, how time flies. I must be getting old!",
                "  Well, my oldest is named Sara and she's a doctor. And then there's my son, Tom, who is an engineer. And my youngest, Emily, is a teacher. They're all doing so well.",
                "  Yes, I loved playing for everyone. It brought me so much joy.",
                " Yes, my husband's name is John.",
                " Her name was Margaret.",
                " My son's name is David and my daughter's name is Lucy. They're both grown up with families of their own now. I don't see them as often as I used to.",
                " I suppose I am a little scared. Everything seems so unfamiliar.",
                " Grandpa's name was John. He passed away a few years ago, Grandma. (20)",
                " You have two children, Mom. Me and your son. Do you have a spouse? What is their name? (6)",
                " Yes, her name is Mary. She's lovely.",
                "  John... that name sounds familiar. And where do we live?",
                "  Yes, my husband's name was John. He was a wonderful man.",
                "  I'm not sure. Sometimes I feel like I'm lost and can't find my way back home.",
                " I'm not sure. Maybe it's 1965? ",
                " (shocked) 2021?! How did the time fly by so quickly? ",
                "  Oh my. I hope it's nothing serious. Can I go home soon?",
                " I have three kids, two boys and a girl. They're wonderful. ",
                " I can't remember.. ",
                " Yes, my husband's name was Jack. He was my rock and my soulmate."
            ],
            "repsonses": [
                "(7) Where do you live? "
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "(8) What are your hobbies?",
            "patterns": [
                " It was so beautiful there. The sand was soft and warm, and the waves were so calming.",
                "  Oh, I see. ",
                "  2021? That can't be right. I feel like it's still the 90s. ",
                "  I have two children, a son and a daughter. They're both grown now, but they always stay in touch.",
                " Oh yes, I remember that. We had so much fun!",
                "  I am. I wish I could remember things better.",
                "  I can't seem to remember anything about them right now.",
                " Is it... summer? ",
                "  Oh yes! That was always so much fun. (20)",
                " Oh my, that long already?",
                " I don't know, maybe five or six.",
                " Oh, yes! I love gardening and cooking. They both bring me so much joy.",
                "  Hmm, let me think...I believe I have six grandchildren.",
                " Yes! That was such a lovely day. I remember building sandcastles with my children. ",
                "  I'm not sure, could you remind me?",
                "  Hmm, I can't seem to remember their names right now.",
                " I used to live in a cozy neighborhood near the park. It's been a while since I've been there.",
                "  Yes, I love reading. My favorite book is Pride and Prejudice by Jane Austen.",
                " I'm not sure... I feel like I'm forgetting things so quickly.",
                " I have two children.",
                "  I'm not sure.",
                "  Is it already that time? Time flies, doesn't it?",
                " What are my hobbies?",
                " June 8th? That seems important, but I can't remember why. ",
                "  Is there something you wanted to talk about?",
                "  No, I don't remember.",
                " Oh, I love the summer season. And I think it's summer right now.",
                " Yes, I think I'm in a hospital. But I don't know which hospital or why I'm here for that matter.",
                " 2021? That seems so far away.",
                " I'm not sure, to be honest. It all looks the same to me.",
                " January 15th? Oh my, time really flies, doesn't it?",
                "  Yes, I do remember that. We had so much fun.",
                " Oh, yes. It's winter. I can feel the chill in the air.",
                "  Oh, yes! I remember that vacation, we had such a wonderful time together.",
                " Yes, I live... I can't remember. ",
                "  Oh, I can't remember. (20)",
                "  Oh my goodness, time flies by so quickly.",
                " I used to live in a house near the park. It was a lovely little place.",
                " I can't seem to remember their names or faces. ",
                " Of course I do! His name is George. He should be here any minute now.",
                " I live in the same house I've lived in for years, dear. It's a cozy little place.",
                " Oh yes, I used to love to read.",
                "  I'm not sure. ",
                "  Oh, well I have a daughter and a son. They are both grown up now, I think.",
                "  Yes, I remember that. ",
                " (smiles) I love this time of year.",
                " Oh, right. Thank you for reminding me.",
                " Hmm, I used to like gardening, but I haven't done that in a while. I also used to play the piano.",
                "  Oh yes, I remember that! It was so much fun. We caught a lot of fish.",
                "  Yes, I remember that! We had so much fun playing in the sand.",
                " Yes! It was the most fun I've ever had. We built sandcastles and swam in the ocean.",
                " (17) Friends in school? Oh, yes! I had such a great group of friends. We used to play all sorts of games and get into all sorts of trouble. ",
                " Oh yes, I remember that. It was so beautiful. ",
                "  I used to love romance novels. They were always so exciting. But lately, I've been having trouble remembering things.",
                "  Oh yes, I remember when he took me on a picnic by the lake. It was such a beautiful day.",
                "  I used to live in a house but I don't know where it is now.",
                " No, I can't remember.",
                "  Their names...I’m sorry, I can't seem to remember.",
                "  Oh my, time seems to be slipping away so quickly. Wasn't it just yesterday that we celebrated Christmas?",
                "  Springtime? I used to love seeing all the flowers bloom.",
                " Spring? Hmm, I don't know if I like spring.",
                "  I don't know, maybe. ",
                " Yes, I have a spouse. But I can't remember their name. ",
                " I used to love painting and drawing. Have you seen any of my artwork?",
                "  I think I live in a house, but I can't remember where it is.",
                "  No.",
                " Yes, I do remember that. It was such a wonderful time.",
                "  Yes! We had such a wonderful time. The sun was shining and we had so much delicious food to eat. ",
                "  When I was a little girl, I used to pick apples with my family. It was so much fun. ",
                "  Yes, I do. I used to love reading mystery novels.",
                "  Oh, I love summer. I remember spending all day at the beach with my family when I was a kid.",
                " Oh, they're all such wonderful people. My daughter is a nurse, my oldest son is a lawyer, and my youngest is a teacher. I'm so proud of them.",
                "  A little bit, yes. I don't understand what's going on.",
                " Oh yes, I remember when my daughter got married. It was a beautiful day.",
                " His name is Tom. ",
                "  Oh my... that's quite a difference.",
                " I live in a big house on Maple Street.",
                " I used to live in the city, but I'm not sure where I am now.",
                " Oh yes! That was so much fun.",
                " Yes! That was such a fun time. We built sandcastles and went swimming in the ocean.",
                " Oh yes! I remember that. We had such a wonderful time, didn't we? The music was beautiful.",
                " I used to live in a big house with a beautiful garden. But I'm not sure where I am now.",
                "  Oh, okay. Thank you for telling me.",
                " Yes, his name is John.",
                " I have three children. Two boys and a girl. They're all grown up now and have their own families to take care of.",
                " Yes, my husband's name is John. Where do I live? (7)",
                "  That sounds nice.",
                " Oh yes, I remember that! It was such a nice time.",
                "  Summer... that's my favorite season. What are some hobbies that I used to enjoy?",
                " Read to me? Oh, I love reading. What book do you have? Tell me, what are your hobbies?",
                " We used to live in a small town, but I can't remember the name of it right now.",
                " Three! They are all so successful now. ",
                " Three, you say? My, they must be all grown up by now.",
                " Is it really? I hadn't realized. Time flies, doesn't it?",
                "  Oh, I see. I don't remember coming here, but the staff seem very nice.",
                "Grandma: Oh, yes! My son is John, and my daughter is Jane. They were always so good to me.",
                " Is it? I've lost track of time. ",
                " I don't remember, sorry.",
                " No, no. Why would I be scared? I'm a grown adult, you know.",
                "  Two. A son and a daughter.",
                "  Oh, I have three children. Two boys and one girl. They are all so wonderful.",
                " Oh, thank you for letting me know.",
                "  Oh, I have a few children, but I can't remember how many. What would you like to know about them?",
                " I used to live in a cozy little house on Maple street. It was the perfect place to call home."
            ],
            "repsonses": [
                "(8) What are your hobbies?"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "(9) Are you feeling scared? Afraid? Tell me more about how you are feeling. ",
            "patterns": [
                " Sick? I don't feel sick.",
                "  Oh, really? I don't feel sick. ",
                "  Yes, his name is John. Is he here with me?",
                " (20) Mhhm.",
                "  Sick? I don't remember being sick. ",
                "  I used to love it, but it's been a while since I've read anything.",
                " I'm sick? I don't remember being sick.",
                "(Another short pause)",
                "  It was great spending that time with you. Thank you for bringing up that memory. ",
                " Oh, I see. I don't feel sick.",
                " I wish I could remember so many things. It's frustrating not being able to.",
                " Scared? Why would I be scared?",
                "  I have two children, a boy and a girl. They used to come visit me often.",
                "  I don't feel sick.",
                " Well, my daughter is a teacher and my son is a doctor. They both live far away though, so I don't see them as often as I'd like. ",
                "  Oh no. That's so sad. (16)",
                "  Sick? What's wrong with me?",
                " Oh, I see. But I don't feel sick.",
                " The beach? Oh, yes! We had so much fun, didn't we?",
                "  Oh, I see...I don't feel particularly sick. What's wrong with me?",
                " Ah, okay.",
                " Really? I don’t remember being sick. ",
                "  Am I really? I don't feel sick.",
                "  Yes, I don't like being in the hospital.",
                "  Oh, it's fall? I always loved the changing colors of the leaves.",
                " I used to love gardening, reading, and playing piano. They were my favorite things to do.",
                "  Yes, I don't know what's happening to me.",
                "  Yes, my husband's name was John. He was a wonderful man.",
                "  I used to love gardening and cooking. I miss those activities.",
                " Yes, I am. I don't know what's going on.",
                " Yes, I don't understand why I'm here. It's all so confusing.",
                " I used to live in a big house, but now I can't remember where it was.",
                " Scared? Why would I feel scared?",
                " Well, I have three wonderful children. Do you know their names?",
                " I'm not sure. Do you think I should be?",
                "  I loved to garden and paint.",
                "  I have three children... Sarah, Michael, and... I can't remember the other one.",
                " I can't remember where they went off to. It's hard to keep track sometimes.",
                "  Scared? Why would I be scared? ",
                " My children? Oh, they're all grown up now. Alexander is a lawyer, Emily is a nurse, and Andrew is a professor.",
                " The beach? Yes, I love the beach. It's so peaceful there. ",
                "  Yes, I am. I don't like being in strange places.",
                " My son is such a hard worker, always taking care of his family. And my daughter, she's so kind and caring. I'm so proud of both of them.",
                " Oh, alright. Thank you for telling me.",
                " I am? That's strange. I don't feel sick.",
                " Oh, right. That's what they told me.",
                " Yes, that sounds right. I don't know what's happening to me.",
                " I live in a big white house on Main Street.",
                " Yes, a little bit. But I'm trying to stay positive.",
                "  Yes, a little bit. I don't quite understand what's happening to me.",
                " I used to love gardening and painting. I always found so much joy in creating something beautiful.",
                "  Thank you for visiting me. (19)",
                "  Yes, I am very scared. (16)",
                " Oh dear. Am I going to be all right?",
                "  Oh, I see. I don't really remember feeling sick though.",
                "  Yes, yes I am. I'm scared and confused.",
                " I don't feel sick. ",
                "  Oh my, that's a long time from when I was young. (20)",
                "  I used to love reading books by the fireplace, but my eyesight isn't what it used to be.",
                " Oh, I didn't know that. What's wrong with me?",
                " Yes, I remember now. I'm feeling a bit weak, but I know I'll get better soon.",
                " Oh, okay. Thank you for telling me. ",
                "  A little bit, yes.",
                " Oh yes, I love reading old romance novels. They always have such happy endings.",
                " Yes, I suppose I am. I don't quite know what's happening to my mind, dear.",
                " I am?",
                "  Sometimes, but I forget what I read so quickly. ",
                "  Yes, I am. I don't know what's happening or why I'm here.",
                "  His name was George. ",
                " I used to love gardening and reading, but I haven't been able to do much of either lately.",
                " I have two wonderful children. They both live far away, but we talk on the phone often. They are my pride and joy.",
                "  Sick? I don't feel sick.",
                " I love gardening. I used to have a big garden in my backyard.",
                " Oh, I used to love to garden. There's just something about growing things that brings such joy to the heart. ",
                " Sick? That can't be. There's nothing wrong with me.",
                " I don't feel sick.",
                "  Oh, I don't remember being sick. Is it serious?",
                "  I enjoy painting and drawing. But I get frustrated when I can't remember what I'm trying to create. It's hard.",
                "  Oh really? I don't quite remember. Did I get hurt?",
                "  I used to love gardening and knitting.",
                " I live in the same house that I've always lived in. You know the one. It's just down the road from the park.",
                "  Yes, I remember that! We had so much fun playing in the sand and swimming in the ocean.",
                " Tom and Sarah? Those are lovely names.",
                "  I used to enjoy gardening and cooking, but I don't do much of that anymore.",
                " Oh, not too bad. Everything is just a little fuzzy.",
                "  I... I can't seem to recall. It's all so foggy.",
                "  My children? They're all grown up now. I have two sons and a daughter. They're such wonderful children.",
                "  Oh, okay. Do you know when I can go home?",
                " I am? I don't remember being sick.",
                "  Oh, yes! It was such a lovely day. The sandwiches were delicious.",
                "  Sick? What's wrong with me? ",
                " Sick? What's wrong with me?",
                " Sick? I don't feel sick. ",
                " I am? I don't feel sick.",
                "  I used to like knitting and gardening.",
                "  (Silence)",
                " Is it autumn? I can't quite tell.",
                "  I don't know. I don't always remember how I feel anymore. ",
                "  Yes, that's right. It's a lovely hospital, isn't it?",
                "  Yes, his name was Jack. He was a wonderful man.",
                " Two, a boy and a girl. What are their names?",
                "  The hospital? I don't remember. Am I sick?",
                " Oh, not so great. I'm feeling a bit confused.",
                " I used to love gardening and knitting.",
                " Oh, I am? I hadn't noticed. But thank you for letting me know.",
                "  I'm sick? What's wrong with me?",
                " I love gardening and cooking.",
                " I used to love gardening and playing cards with my friends.",
                " I used to love painting, but I haven't done it in a while.",
                " It's been a while since I picked up a pair of knitting needles though.",
                "  Yes, I don't know what's happening to me. I don't remember things like I used to.",
                " I can't say I'm feeling scared, but I do feel a bit confused. Everything seems to be blurry and jumbled in my mind.",
                " Oh yes, I remember when my children were young and we would go on picnics in the park. Those were such lovely times.",
                " Yes, his name was John. He was such a lovely man.",
                "  I don't feel sick. I'm just tired.",
                " Well, my oldest son is a doctor now. He's always been so smart. My daughter is a teacher, she has two kids of her own. And my youngest son is a musician, he used to play guitar for me when he visited. ",
                " That's right, I remember now. But what's wrong with me?",
                " Sick? What's wrong with me? ",
                "  Okay, thank you for letting me know.",
                "Grandma: Oh, alright. Thank you for telling me. Do you like to read? (10)",
                " I used to love gardening and reading books. However, lately I find it hard to remember what I enjoy doing.",
                " I used to love gardening and knitting, but I don't do much of that anymore. Am I sick? (15)",
                "  Why am I scared?",
                " St. Mary's...that sounds familiar.",
                "  That's right, and they're both such wonderful kids. I'm proud of them.",
                "  Sick? I don't think I'm sick. ",
                " I used to love gardening and cooking, but I don't have the energy for that now.",
                "  I see. I don't feel sick though, am I really sick?",
                "  A little bit, but having you here with me helps.",
                "  Oh, I see. I can't quite remember what's wrong with me.",
                " I'm sick? I don't remember feeling sick.",
                " What? Why would I be scared? ",
                " (pauses) I am scared...I feel so confused about everything. ",
                " Oh, I do! Wasn't the weather just perfect that day?",
                "  Oh, hello dear. I've been better. It's all so confusing.",
                "Grandma: I used to love gardening and sewing. I made all of my children's clothes when they were little.",
                " Is it? I didn't realize. ",
                " Oh yes, we went to the beach, didn't we? It was so beautiful. ",
                " Hospital? No, I don't remember. But I'm sure I'm here for a good reason.",
                "  Oh, I see. I don't feel well.",
                " Ah, yes! Thank you for reminding me.",
                " I am scared. What's going on?",
                " Oh.. I feel so confused.",
                " Oh, I used to love knitting and gardening. It was always so fulfilling to create something beautiful.",
                " Sick? I don't feel sick..."
            ],
            "repsonses": [
                "(9) Are you feeling scared? Afraid? Tell me more about how you are feeling. "
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "(10) Do you like to read?",
            "patterns": [
               "I'm so glad you're here!",
               "I must have been reading a lot lately.",
               "Yes, I do like to read.",
               "I'm so glad you're here!",
               "I don't remember what I like to read anymore.",
               "I'm not sure what you mean.",
               "I don't remember what I used to like.",
               "Oh my, it's been so long since I've seen you!",
               "Yes, I love to read!",
               "I used to read all the time when I was younger.",
               "I'm not sure what you're talking about.",
               "My memory isn't what it used to be.",
               "Yes, I used to read all the time.",
               "I love to read!",
               "I used to read a lot when I was younger.",
               "I love to read when I can remember the words!",
               "I'm feeling a bit tired today.",
               "I used to love reading when I was younger.",
               "I love reading books!",
               "I'm so glad you're here!",
               "I'm so glad you're here!",
               "I used to love to read.",
               "I'm feeling a little foggy today.",
               "Yes, I love to read!",
               "Oh my, it's been so long since I last saw you!",
               "My favorite color is blue.",
               "I love to read!",
               "I used to love to read.",
               "I love to read!",
               "I'm so glad to see you, Bob!",
                " I used to enjoy knitting and reading, but I haven't done much of either lately.",
                "  Well, I used to love knitting and reading. I'm not sure if I can still do those things now.",
                " I don't know, I feel confused.",
                " Is it? That's nice.",
                " I am feeling a bit confused about everything, but I am not afraid. Everything will be alright.",
                "  Yes, I'm married to Jack. Jack Smith.",
                " I'm not sure. I think I used to live in a big house with Mary and my children.",
                " Hobbies? Well, I used to love gardening and reading books.",
                "  I feel lost and confused. ",
                " I was married, but my husband passed away. His name was Daniel.",
                " Hey, do you like to read? I used to love reading when I was younger.",
                "  I used to love gardening and knitting.",
                " I don't have any hobbies. ",
                "  She's a teacher and loves to read. It's always been such a joy seeing her succeed in life.",
                " Well, I love to read and knit. Those are my favorite things to do.",
                " Oh, okay. Thank you for telling me. ",
                " I love knitting and baking cakes. Do you want to help me make a cake?",
                " Do you like to read?",
                "  I used to love gardening. ",
                "  Thank you. ",
                " I don't know. I just feel confused and disoriented. I don't understand what's happening.",
                " Yes, his name was John. He passed away a few years ago.",
                "  Thank you. I appreciate that. I used to love reading. Do I still read?",
                "  Well, I used to love gardening and playing board games. They were always so much fun.",
                "  I feel confused most of the time. I don't remember things and that scares me.",
                " Okay.",
                "  Oh, okay. Thank you for letting me know.",
                " Oh, I must have lost track of time.",
                " Scared? Why would I be scared? Is something wrong?",
                "  Sometimes I feel a little confused and scared, but I try not to think about it too much.",
                "  (Silence)",
                "  Do you like to read?",
                " My, how time flies. I can't seem to remember anything past a few years ago. Do you like to read?",
                " Today is...I'm not quite sure, actually. But does it really matter?",
                " ",
                " Well, I used to love gardening and painting. But I don't really do much of that now.",
                " You used to live in your house in the suburbs, but now you're staying in the hospital. (14)",
                " Well, I used to love gardening and knitting.",
                " Yes, Mom. We brought you to the hospital because you were feeling a bit unwell. Are you feeling scared or afraid? (9)",
                " (smiling) Ah, I love the fall. The leaves turning beautiful colors... "
            ],
            "repsonses": [
                "(10) Do you like to read?"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "(11) Today is <insert date> ",
            "patterns": [
                " No, I don't remember.",
                "  Three. Sarah, Michael, and David. ",
                " What's today's date?",
                " It's summer! I love summer. The sun is shining, the birds are chirping, it's just wonderful.",
                "  Yes, I do! That was a long time ago. ",
                " Oh... no, I don't remember.",
                "  Ah, I thought so.",
                " Well, my oldest son is an engineer, my daughter is a teacher, and my youngest son is still in college.",
                "  No, I don't remember that.",
                "  No, I think I just need some time to adjust.",
                " Oh yes, I love to read all sorts of books.",
                "  No, I don't remember. Can you remind me?",
                " It's summer, can't you feel the warmth?",
                " Sometimes I feel scared, but I'm not sure why.",
                "  (shakes head) I never really enjoyed it.",
                " Oh, I'm just fine. How about you, young lady?",
                " Scared? No, not scared. Just a bit lost. ",
                "  I wish I could remember more clearly. It's frustrating not being able to keep track of things.",
                " Yes, I do like to read. It's one of my favorite things to do.",
                " Ah, fall. I love the colors of the leaves during this season.",
                " Yes, I do. It's a shame I can't remember the books I used to enjoy reading. ",
                " I couldn't tell you, sorry. It all feels the same to me.",
                " Yes, I do have a spouse. His name is Richard, and he was the love of my life.",
                "  Yes, I do. I used to read a lot of books.",
                "  Is it 1953 already? Oh my, time sure flies by quickly.",
                "  Is it? I'm sorry, I can't seem to remember.",
                " Winter... No, it's summer. ",
                "  No, I don't think so. (20)",
                "  Thank you, that means the world to me. ",
                " Oh, okay. How long have I been here?",
                " Oh yes, I do. I love to read all kinds of books.",
                " Yes, I am. ",
                " I don't know where I am or who I'm supposed to be with. I feel so lost and alone.",
                "  No, I don't. ",
                "  Is it summer? ",
                " (looks confused) No, I don't remember.",
                " I used to love gardening and painting, but I haven't done that in a long time.",
                "  That's good to know. But I still feel confused. What day is it today?",
                "  Oh yes, I love reading. I used to read all sorts of books when I had the time.",
                "  I used to love reading but now I can't remember what I read.",
                " Of course I know what year it is! It's 1955. You know that, don't you?",
                " It's winter, isn't it?",
                "  No, I don't think so. But I feel confused about why I'm here.",
                "  (nodding) Yes, very much so.",
                "  Yes, I think I'm in a hospital. But I don't remember how I got here.",
                "  I used to live in a big house, but now I can’t remember where.",
                " No, I don't think so. But I can't remember why I'm here.",
                "  Yes, I used to love reading books.",
                "Dimentia  Umm... I can't quite remember.",
                " Hmm, I can't really remember. I used to enjoy sewing and gardening, I think.",
                "  I can't seem to recall their names, but I know they are wonderful kids.",
                "  Yes, please. What day is it today?",
                " Oh, it's no matter. I'm sure it'll come to me eventually.",
                " ",
                " Is it... 1950?",
                " Oh, alright. Do you happen to know the date today?",
                " Yes, I love reading. It helps keep my mind occupied.",
                "  No, I'm not sure. Can you tell me?",
                " I understand, Grandma. But you don't have to worry about anything. I'll be here with you and take care of you every step of the way. (19)",
                " Yes, I love reading. It's one of the few things that still makes sense to me.",
                " Oh my, I'm really far behind on my calendar then. What year is it?",
                " Yes, I'm married. His name is John. But I don't remember where he is right now.",
                " (sighs) Thank you for coming to visit me, it means a lot. ",
                " Yes, I do! It was wonderful. ",
                "  I believe I'm in a hospital, but I can't quite remember how I got here.",
                "Grandma: Yes, a little. But you're here with me, so I don't feel so alone.",
                " Yes, I think I'm in the hospital.",
                " Yes, I do. My husband's name is John. He's such a kind man.",
                "  I've never heard of this place before. Can you take me home?",
                " Can you tell me what day it is?",
                "  Oh, I don't remember being sick. Why am I here again?",
                " No.. ",
                " Well, sometimes I feel a bit confused and lost. But you're here with me now, and that makes me feel comforted."
            ],
            "repsonses": [
                "(11) Today is <insert date> "
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "(12) It is the year <insert year> ",
            "patterns": [
                " (15) You are in the hospital because you are sick. ",
                "  August? Wow, the year sure flew by. ",
                "  I'm sorry, I'm not sure.",
                " And what year is it?",
                "  Hmm... I'm not quite sure. Is it 1950? ",
                " I'm not really sure. The numbers don't make sense to me anymore.",
                "  No, I don't.",
                " Oh, okay. ",
                "  Oh okay. Do you know my husband? (2)",
                " I'm not quite sure, could you tell me?",
                " Hmm, I'm not sure. Can you tell me?",
                " I... I don't remember.",
                " Oh, I love to read. I can’t remember the last book I read, though. ",
                "  Oh, I didn't know that.",
                "  I'm sorry, I can't seem to remember.",
                " Hmm.. I am not quite sure. Can you remind me?",
                "  Hmm...I'm not sure. Is it 1950?",
                "  No, I don't remember. Can you remind me?",
                " Oh, I see. Do you know what year it is?",
                " Is it 2020?",
                "  (nods)",
                "  Hmm...I'm not quite sure. Could you remind me?",
                "  I'm not sure, can you remind me?",
                " I'm not quite sure. Could you tell me?",
                " Oh, goodness, I can't recall.",
                " Hmm, I'm not quite sure. I'm sorry.",
                "  Hmm, I'm not quite sure. What year is it?",
                "  Oh, okay. What year is it? (2)",
                " Let's see... 1972?",
                " I live in the same house I've lived in for years.",
                "  They were such wonderful kids. Always so kind and caring. I miss them dearly.",
                " Winter... No, it's summer. ",
                "  No, I have no idea. (20)",
                "  I'm not sure... is it 1950?",
                " Oh goodness, I'm afraid I don't. Could you tell me?",
                "  Do you know what year it is?",
                " Oh my, I'm not quite sure. Is it still the 1950s?",
                " Well, my son is a doctor now and my daughter is a teacher. They are both very successful and I'm so proud of them.",
                " Hmm, I'm not quite sure.",
                " Hmm... I'm not quite sure. Could you let me know?",
                "  Oh okay. And what year is it?",
                "  Oh, is it really? I didn't realize it had been that long.",
                "  Oh, I didn't realize it was March already.",
                "  Hmm, let me think. Is it 1952?",
                "  Is it 1960? I feel like it's been a long time.",
                "  Oh, I see. Thank you for reminding me.",
                "  Is it... 1995?",
                " Yes, it's 1955.",
                " What? I don't even know what year it is.",
                " I'm not quite sure, maybe two or three?",
                "  Oh, okay. Thank you for letting me know.",
                "  No, I don't.",
                "  Me too! Although, the words have been getting harder for me to understand lately. What year is it now?",
                "  1956? No, wait, that's not right. ",
                "  Can you tell me what year it is?",
                "  Hmm... I'm not quite sure. Is it still the 1980s?",
                " Yes, I do have a spouse. Their name escapes me at the moment. Do you know what year it is?",
                "  Hmm, I'm not quite sure. Is it 1952?",
                "  Oh, what year is it then?",
                " Oh, it must be... um... I'm not quite sure.",
                " Oh, okay.",
                " Hm, that seems familiar. What year is it again?",
                " I feel sick, but I can't remember why. ",
                " Hmm, let me think... Is it 1950?",
                " Oh my, I was way off! What year is it then?",
                "  Is it... 1985?",
                " Hmm, I'm not sure. Maybe 1950?",
                " No, I'm not quite sure. What year are we in?",
                " Yes, I believe it is 1960.",
                " Is it 1956? I feel like it's been a long time since I've been out and about.",
                " Hmm... I'm not too sure about that one.",
                " Hmm, I'm not quite sure.",
                "  Is it spring? The flowers outside are so pretty.",
                " Yes, I am. I wish I could make sense of everything.",
                " Two, a boy and a girl. ",
                "Grandma: Oh, I see. Do you know what year it is? (2)",
                " Oh, I had lost track of the days. Thank you for telling me.",
                " Hmm... let me think... is it 1950?",
                "  Do you know what year it is?",
                " It's...it's hard to remember. What year is it?",
                " Oh no, I hope it's not serious.",
                "  Ah, I see. And what year is it?",
                "  I'm not sure, can you tell me?",
                " John? Oh, that's right. I forgot. (pauses) Do you know what year it is?",
                " Oh, what season is it? I can't remember.",
                " Thursday? That means tomorrow is Friday...oh no, I need to go grocery shopping! ",
                " Hmm, I'm not quite sure. Could you tell me?",
                " I'm not quite sure, dear. Could you remind me?",
                "Grandma: Is it really? My, how time flies. It feels like just yesterday I was a little girl playing with my friends.",
                " A little bit, yes. But I'm grateful to have family and friends to support me. ",
                "  That doesn't mean anything to me.",
                " Oh dear, I'm not sure about that either.",
                " Oh, I'm not quite sure. What year do you think it is?"
            ],
            "repsonses": [
                "(12) It is the year <insert year> "
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "(13) It is <season> now ",
            "patterns": [
                " Is it summertime? It feels like summertime.",
                "  Is it summer? ",
                "  I'm not quite sure about that either.",
                "  No, I can't seem to remember.",
                "  I think it might be springtime. The flowers are blooming and the air is warm.",
                " Is it winter? It feels like winter.",
                " I'm sorry, but I have no idea. My mind is such a jumbled mess.",
                "  Oh, okay. ",
                " Oh, okay. That makes sense. Do you know what season it is?",
                "  I'm not sure, but I think it might be winter.",
                " Yes, I am. ",
                " Is it, already? Time really flies, doesn't it? ",
                "  Is it winter?",
                "  Oh, I loved gardening when I was younger. I always had the prettiest flowers.",
                "  I think it might be summer?",
                " Oh, yes! I love to read books about history and travel.",
                " Is it summer yet? I can't wait for the warm weather!",
                " 2021? That can't be right. I think I'm still in the 1950s.",
                "  (looks unsure)",
                "  Let me think...I'm not quite sure. Could you tell me?",
                " I'm not entirely sure. Could you tell me?",
                " Oh, okay. Thank you for letting me know.",
                " Season? Hmm, I'm not quite sure. Is it winter already?",
                " Is it winter? I can't quite remember.",
                " Oh, I see. Thank you for letting me know. ",
                "  Let me think...is it winter?",
                "  Is it winter time yet? It feels pretty cold.",
                " Hmm, let me think. Oh dear, I'm afraid I don't remember.",
                "  Oh, okay. What season is it? (3)",
                " 2021? That can't be right.",
                " I'm not quite sure... is it winter?",
                " I am not sure. ",
                "  Wow, that long ago?",
                " Hmm, let me think. Is it winter, dear?",
                " (shakes head) I don't remember.",
                " I think it might be summer, but I could be wrong. Is it?",
                "  My, how time flies. Do you know what season it is?",
                "  Wow, time really flies by, doesn't it?",
                "  Wow, time really goes by fast.",
                "  I used to read a lot, but it's hard to focus now.",
                "  It feels like summer outside.",
                "  Oh, I didn’t know that.",
                " Is it winter?",
                " I used to love to read and do puzzles. ",
                "  I can't believe it's already <insert current year>!",
                " I'm sorry, I don't remember what today's date is.",
                "  Winter, I think. But it feels like summer sometimes. ",
                "  Well, besides reading, I used to love gardening and going for long walks.",
                " Oh dear, that's not good. Do you know what season it is?",
                "  I live in the house we bought when the kids were young. It's a nice little place.",
                "  Is it springtime? The flowers outside are blooming beautifully.",
                " Well, it must be... autumn?",
                " I'm sorry for your loss. Do you know what season it is now? (3)",
                " I'm not sure. Can you tell me?",
                "  Is it summertime?",
                " Is it winter? It's so cold outside.",
                " I'm not quite sure. Is it winter?",
                " I believe it is autumn.",
                " October 10th... that means it's getting chilly outside! Do you know what season it is?",
                " Hmm, I'm not quite sure. Is it winter?",
                " I've lost track of seasons, honestly.",
                " Is it winter? It's so chilly.",
                " Is it summer yet? I always loved summer as a kid. ",
                " No, I'm not sure. ",
                "Grandma: Oh my, time flies by so fast. Do you know what season it is? (3)",
                " Really? It feels like it was just yesterday when it was the year 2000.",
                " Well, it feels like summer outside with all this heat.",
                " I'm not sure. Is it summer?",
                "  Is it winter already? I feel like time is passing so quickly.",
                "  My goodness, time sure flies doesn't it? Do you know what season it is?",
                "  I'm not quite certain, sorry.",
                " Is it summer? No, wait, maybe it's winter.",
                " Is it winter already? ",
                " (pauses) I think it's around 1995? ",
                " Let me see...is it winter?",
                "  I don't know... I don't really remember feeling scared, but maybe I am? Is there a reason to be scared?",
                "Grandma: Goodness gracious! That's hard to believe. What season is it now? (3)",
                " Three, if I remember correctly. ",
                "  I think it might be winter.",
                "  I don't know. I feel confused and disoriented.",
                " I'm not sure about that either. Is it spring, summer, fall, or winter?",
                " Is it winter?",
                " I'm not sure. Is it summer yet?"
            ],
            "repsonses": [
                "(13) It is <season> now "
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "(14) You are in <insert name of hospital>",
            "patterns": [
                " Oh, hello! I'm doing alright. Who are you?",
                " I think I'm in a hospital, but I don't know which one.",
                "  No, I'm not quite sure. Is this the hotel we stayed at last year?",
                "  I'm not sure. Where am I?",
                "  I don't know. Where am I? ",
                " Oh, I am doing well. Just waiting for my husband to come pick me up.",
                "  I'm not sure where I am. Do you know where we are? ",
                "  I believe I'm in a hospital.",
                " I think I'm at home, but it doesn't look familiar.",
                "  No, I don't remember. Can you tell me?",
                "  My son, John, is an engineer. He has a wife and two children of his own. My daughter, Lisa, is a nurse. She has a husband who is a lawyer. They're both doing so well for themselves. I'm very proud of them. ",
                " I am. I can't remember where I am or why I'm here.",
                "  I'm...not quite sure. Somewhere...familiar, I think.",
                " I think I'm in a hospital. But I don't know why I'm here.",
                " Of course I do, I'm at home.",
                "  I don't know. I don't recognize this place.",
                "  I don't know. Where am I?",
                "  No, I really don't.",
                "  I'm not sure. Where am I? (1)",
                "  Oh, hello dear. I'm feeling a bit confused. Where are we?",
                " Of course, I'm at home. Can't you see that?",
                " I don't know, I don't remember.",
                " Of course, I'm in my house. This is where I've always lived.",
                " Hmm, I'm not quite sure. Where do you think we are?",
                "  I believe I am in a hospital, but I'm not entirely sure.",
                " Of course, I’m at home. ",
                "  No, I'm not sure.",
                "  I'm not sure, where am I?",
                "  Hmm, I'm not quite sure. It looks like some sort of hospital.",
                "  No, I don't know.",
                "  Yes, I'm in a hospital, right?",
                "  I'm not sure. Where am I?",
                " I think I'm in some sort of hospital or facility.",
                " I'm not sure, but it's nice here.",
                " I'm sorry, I don't remember what today is.",
                " I'm not exactly sure... Am I at home?",
                " You know, I think I'm a bit confused. Do you know where we are?",
                " This is a hospital, isn't it?",
                "  (smiles) I love summer.",
                "  Yes... I don't know where I am.",
                "  Good to hear. What brings you to visit me today?",
                "  I think I'm in my childhood home.",
                " I don't quite remember. Could you remind me?",
                " Yes, I am. Where am I?",
                " Not really. I feel like I'm supposed to know, but everything seems unfamiliar. ",
                "  I believe I'm at home, but something feels different.",
                "  No, I don't. Can you tell me?",
                " Hmm, I'm not quite sure. Could you remind me?",
                " Oh, okay. Thank you for letting me know.",
                " Oh, good. Are you here to visit me?",
                " I suppose I'm in a hospital, but I can't quite remember why.",
                " No, I can't recall.",
                " Oh, I’m doing ok. I think I’m ready to go home now though.",
                " Vacation? Oh, I'm not sure. Where did we go?",
                "  I'm not quite sure, to be honest. Can you tell me?",
                "  Yes, I believe I'm in a hospital.",
                " I'm not quite sure, could you remind me?",
                "  Confused. Where am I?",
                " Hmm, I'm not quite sure. Somewhere familiar, but I can't place it.",
                " Yes, I am scared. I don't understand what's happening.",
                "  I'm not quite sure, dear. I think I might be at home?",
                "  I'm in my room, right?",
                "  I...I don't seem to recognize this place. Have I been here before?",
                " Confused. Where am I?",
                "  Oh wow, that's right around Thanksgiving. I hope we can have a big family dinner together.",
                " Hm, I'm not quite sure. I do remember being in a hospital recently, though.",
                " Yes, I don't know where I am or why I'm here.",
                " No, I don't. Can you tell me?",
                " Well, I'm not exactly sure. It seems to be some kind of hospital, but I can't remember which one.",
                " No, I don't. Can you tell me where I am? ",
                "  I don't know. I don't remember where I am.",
                " Well, it's just all so confusing. Sometimes I don't even recognize the people I love.",
                " No, I don't. Can you tell me?",
                "  I'm not exactly sure...Am I in a hospital?",
                "  No, I don't remember. ",
                " I...I don't remember.",
                " I'm not sure, could you remind me?",
                " Um, I'm not sure. Could you remind me?",
                "  I don't know, I don't remember. Where am I?",
                "  I'm not quite sure. Maybe a hotel?",
                " Is it summertime? I love the beach.",
                " Hmm... I'm not quite sure. Could you remind me?",
                " Of course, I'm in my house. Why do you ask?",
                " I think I'm at home. ",
                "  No, I don't. Can you tell me where we are?",
                " That's good to hear. Do you know where we are right now?",
                "  No, I don't recognize this place. It's all so unfamiliar.",
                "  Is it already <season>? Seems like the year is just disappearing.",
                "  I don't like the snow very much.",
                " Yes, that was a great day. We caught so many fish! Do you want to go fishing again tomorrow?",
                "  Umm, I believe I'm at the post office. My granddaughter needs me to mail a letter for her.",
                " It's 1950, I think.",
                "  No, I don't recognize this place.",
                " Yes, I think so. I can't remember where I am or why I'm here.",
                "  No, I can't seem to remember.",
                "  Oh yes, it was such a lovely time. The sun was shining, and we caught so many fish.",
                "  I’m doing okay, but where am I?",
                " I'm not sure. Am I at home?",
                "  I feel a bit confused and lost. It's hard to keep track of everything.",
                "  Yes, of course. I am at home, aren't I? ",
                " Oh, not so good. I think I need to go home.",
                " I'm feeling confused. Where am I?",
                " Oh, hello dear. I'm not sure. Can you remind me where I am?",
                " I don't know, dear. Can you tell me where we are?",
                " 2021? That's impossible, I thought it was only 1950.",
                "  That's right, it's still winter.",
                "Dimentia  No, I can't remember.",
                "  I don't know.",
                " I'm not entirely sure. It looks like a hospital room.",
                " Of course, I'm in my home.",
                "  Oh, good to hear. Do you know where we are?",
                "  I'm not quite sure. ",
                "  Do you know where we are? ",
                "  Of course I do! I'm in the hospital, silly.",
                " Oh, hello! I'm not sure, do you know where we are?",
                "  Of course, I'm at home.",
                "  Yes, I'm in the hospital. I'm not exactly sure which hospital though.",
                " I'm not sure. Can you tell me where we are?",
                " I'm in a hospital, but I can't remember which one.",
                " I'm not sure. Am I at home?",
                " ",
                " Yes, I am. Everything is so unfamiliar and strange.",
                " Hmm, I'm not quite sure. Maybe at home?",
                " No, I'm not sure. Where am I?",
                " Of course, I'm in my own home.",
                "  I'm doing okay. I was just wondering when I can go home.",
                " That's good to hear. Say, do you know where I am?",
                " I'm not quite sure. Why don't you tell me?",
                " I think I'm in a hospital, but I'm not quite sure which one.",
                " Yes, I think I'm in a hospital.",
                "  I think I'm at home.",
                " I'm not sure, to be honest. I feel like I'm in a hospital, but I don't remember how I got here.",
                " I think I'm at home, but something doesn't seem quite right.",
                " No, I don't recognize this place. ",
                "  Yes, I am. I don't know where I am or what's happening.",
                "Grandma: Oh, I see. That's why I haven't seen him around. And where do I live? (7)",
                " I used to love the fall. The colors of the leaves were always so beautiful.",
                " Of course I do! I'm in my bedroom.",
                "  I don’t know. Where am I?",
                " I...I can't quite remember.",
                "  I'm not quite sure, could you remind me where I am?",
                "  Do you know where we are right now? I seem to have lost my way.",
                " Of course, I'm in the park.",
                "  I'm not quite sure, could you remind me?",
                " Two children? Oh my, I can't quite recall. Do you know where I am right now?",
                "  Hmm, I'm not sure. I feel like I've been here before.",
                " I don't know. What's going on?",
                " I'm not sure...somewhere important? ",
                " I don't quite remember. Could you tell me?",
                "  I'm not sure. Do you know?",
                "  Is it? I can't seem to tell, but I hope it's one of my favorites.",
                "Grandma: Oh, I always loved the summer. The flowers are so beautiful, and the ice cream tastes so good.",
                " I'm not sure, is this my house?",
                " Ah yes, summer. That's a wonderful season, isn't it? So sunny and bright.",
                "  I don't know. It doesn't look familiar.",
                "  No, I don't. Can you please tell me?",
                " I can't quite remember their name at the moment. Could you remind me?",
                " I'm not sure, it all looks unfamiliar to me.",
                " I'm not sure, could you remind me?",
                " I can't remember.. where am I?",
                " Yes, I think I'm in my home. "
            ],
            "repsonses": [
                "(14) You are in <insert name of hospital>"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "(15) You are in the hospital because you are sick.",
            "patterns": [
                " Hospital? Why am I here?",
                "  Oh, I see. Why am I here?",
                "  Why am I here?",
                "  Why am I here? ",
                " Yes, I don't understand what's happening to me.",
                " Oh, okay. Why am I here?",
                "  Hospital? Why am I here? ",
                " Oh, the hospital? Why am I here?",
                "  Oh, I see. Why am I here?",
                "  Oh, right. I remember now. I'm here because I'm not feeling very well, am I? ",
                " The hospital? Why am I here?",
                "  Oh, I am? That's why everything looks so white.",
                " Hospital? Why am I in the hospital?",
                "  Hospital? Am I sick?",
                "  Why am I in the hospital?",
                "  Oh, okay. Why am I here again?",
                " Umm... I think I'm at home?",
                "  Hospital? Why would I be in a hospital?",
                " Oh, I am? I don't remember how I got here.",
                " Why am I here?",
                " Oh, really? Why am I here? Am I sick?",
                " Hospital? Why am I here?",
                "  St. Mary's? I don't think I've been here before.",
                " Who are you? Where am I?",
                " Oh, I am? I must have forgotten.",
                "  Oh, I am? I don't remember how I got here.",
                "  Why am I here?",
                "  Hmm, I'm not quite sure. It looks like some sort of hospital.",
                "  Why am I here?",
                " Oh, thank you for telling me. I don't remember how I got here.",
                " Oh, I see. How did I get here?",
                " Oh, I see... Why am I here?",
                " Why am I here? Is something wrong?",
                "  Is it serious?",
                "  Hospital? Why am I here?",
                "  Yes, I do. I'm in the hospital, right? But why am I here again?",
                " They used to visit me all the time when I was at home. Do they still come to see me here?",
                "  Oh, really? How did I get here?",
                " Why am I here? ",
                " The hospital? Why am I here? ",
                "  Oh, I see. Why am I here?",
                "  Why am I here?",
                " I'm not sure, I can't seem to remember.",
                " I don't remember why I'm here. Do you know?",
                " I'm sorry, I'm feeling a bit confused right now. Can you remind me why I'm in the hospital? ",
                " Oh my, that's right. Thank you for reminding me.",
                " Really? Why am I here again?",
                " Hospital? Why am I in the hospital?",
                " Hospital? Why am I in the hospital?",
                "  Why am I here? What's wrong with me?",
                " Scared? Why would I be scared?",
                " The hospital? Why am I here?",
                "  Oh, really? Why am I here?",
                "  Oh, right. Why am I here again?",
                " Why am I here? ",
                "  No idea. (20)",
                "  I think I'm at the park with my friends.",
                " Ah, thank you for reminding me. Why am I here again?",
                " Really? My, how time has flown by. ",
                " Who are you? Why am I here? ",
                "  Oh, why am I here?",
                " Why am I here?",
                "  I'm not sure. ",
                "  Oh, okay. Why am I here?",
                " I don't really know. Sometimes I feel a little confused and disoriented, but I try not to dwell on it too much.",
                "  Why am I here?",
                "  Oh, I see. Why am I here?",
                " I think I'm in a hospital. But why am I here?",
                " Hospital? No, no, no. I can't be in the hospital. I need to get home and take care of my children.",
                " Why am I here?",
                "  Hospital? Why am I in the hospital?",
                " Ah, I see. What are we here for, again?",
                "  I think I got sick. But I can't remember what happened.",
                "  Hmm, I'm not quite sure. Maybe in a hotel?",
                "  Thank you for telling me.",
                "  Hospital? Why am I in the hospital? Is everything okay?",
                " I'm not sure, I think I'm in a hotel room.",
                "  Who are you? Why am I here?",
                " Oh, I am? I don't remember coming here.",
                "  Hospital? Why am I here?",
                "  Mercy Hospital, you say? Oh my, why am I here?",
                "  Why am I in the hospital? Did I do something wrong?",
                " The hospital? Why am I here?",
                "  The hospital? I don't remember coming here. Why am I in the hospital? ",
                " Hospital? Why am I here?",
                " Why am I in the hospital? ",
                " Oh, that's right. Did I have an appointment?",
                " Oh, really? I don't remember coming here.",
                " St. Mary's Hospital? How did I end up here?",
                "  Thank you for reminding me.",
                " Oh, okay. Why am I here?",
                " Really? That's strange. Why am I in the hospital?",
                "  Hospital? Oh, I don't remember being here before. Why am I in the hospital?",
                "  Oh, is that right? How did I get here? ",
                "  Why am I here?",
                " Oh, thank you for letting me know. I can't seem to remember why I'm here.",
                "  Why am I in the hospital? I don't remember being sick.",
                " Hospital? Why am I here?",
                "  Oh, hello! I'm feeling confused. Where am I?",
                " Oh, that's right. Why am I here?",
                " No, I don't recognize this place. ",
                " Really? That long ago? Time certainly flies by quickly.",
                " Of course! We used to have so much fun feeding the ducks and having a picnic on the grass. Those were the good old days.",
                "  Oh, am I? Why am I here?",
                " Mercy Hospital? I don't remember being here before.",
                " I'm not sure. Is this a hospital?",
                " Hospital? Why am I here?",
                " Oh, am I sick?",
                " Why am I here? Is something wrong?",
                "  Why am I here?",
                " Oh, I see. And why am I here again?",
                "  Why am I in the hospital?",
                " Oh, I see. Why am I here?",
                " Hospital? Why am I in the hospital? ",
                "Grandma: Yes, I'm in the hospital. But why am I here?",
                " No.",
                " Hospital? I don't remember being here before.",
                " You live in a nice retirement home, Mom. What are your hobbies? (8)",
                "  Why am I here?",
                "  Hospital? What happened to me?",
                "  Hospital? Why am I here? ",
                " The hospital? Why am I here?",
                "  Oh, okay. Why am I here?",
                "  I used to live in a small town, but now I'm not sure.",
                " Hospital? Why am I in the hospital? Am I sick? Is something wrong with me?",
                "  Oh, that's right. Why am I here again?",
                " The hospital? Why am I here?",
                " Oh, I see. And why am I here again? ",
                " Oh, I see. The leaves changing colors outside must be a beautiful sight.",
                "  I'm not sure. It seems like a hospital. But why am I here?",
                "Grandma: Hmm, I'm not quite sure. Is this your house? It looks familiar.",
                "Grandma: St. Mary's? That sounds familiar for some reason. Did something happen to me?",
                " Oh yes, I remember when my children were young and we used to go on family vacations. Those were some of my happiest memories. ",
                " Oh, did I come for a check-up?",
                " Of course I do! I'm in my own bedroom, silly.",
                "  Who are you? Why are you here?",
                "  Really? Why am I here?",
                " I'm not sure, actually. Could you tell me?",
                " Hospital? Why am I in the hospital?",
                " The hospital? Oh, I don't remember coming here.",
                "  Hmm, I'm not quite sure. Are we at home?",
                " Why am I here?",
                " Hospital? Oh dear, why am I in the hospital?"
            ],
            "repsonses": [
                "(15) You are in the hospital because you are sick."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "(16) You must be feeling very scared right now. ",
            "patterns": [
                " Oh, I don't know. I'm feeling confused.",
                "  I don't know what's going on. I feel lost and confused. ",
                " I'm not sure why I'm here or what's happening. It's all confusing.",
                "  Yes, I am. I don't know what's happening to me.",
                "  Honestly, I do feel a bit scared sometimes. It's hard not knowing what's going on or what's real. But I have you here with me, and that makes me feel safer.",
                " I miss her so much. Where is she?",
                "  Sick? Oh dear, what's wrong with me?",
                " Yes, I do feel scared sometimes. I don't know what's happening or what I'm supposed to do. It's all so overwhelming.",
                " Fishing? Yes, I remember that! It was so much fun, we'd always catch lots of fish.",
                "  Sometimes I feel scared. I don’t know what’s happening to me. I can't remember anything anymore.",
                "  Am I going to die?",
                " Yes, your husband passed away a few years ago. (12)",
                "  Yes, I am scared. I don't know what's going on.",
                " Sick? Am I really?",
                " I used to love to paint and draw.",
                "  Well, I used to love gardening and painting. But I haven't been able to do those things in a while.",
                " I don't know... I just feel confused and disoriented.",
                " Summer? That must mean it's time for ice cream! ",
                "  I don't know. I don't remember why I'm here.",
                "  Is he okay?",
                "  Honestly, I'm not quite sure how to feel. It's all a bit overwhelming.",
                "  Yes, that was such a happy day.",
                " Oh dear, I hope it's nothing serious.",
                " Sick? Am I going to be okay?",
                " Is it? I don't know, I can't see outside from here.",
                " I live in a house down the street. It's a cozy place.",
                " Oh, I am? I didn't realize.",
                " You know, I'm feeling a bit confused right now...",
                " I used to love gardening and painting. But I don't remember much now.",
                "  (nods)",
                "  I don't know... I feel confused.",
                " I am? I don't remember being sick. What's wrong with me?",
                " Sometimes, yes. It's scary not being able to remember everything. But I know I have you and my family to support me.",
                "  Sick? I don't remember being sick.",
                " I don't know, dear. Can you help me?",
                "  Oh dear, I hope it's not too serious.",
                "  I liked gardening, but I can't do that anymore.",
                " Sometimes I feel scared because I don't remember things like I used to. But I'm not always afraid.",
                " Hospital? What am I sick with?",
                " Sick? I am? I can't remember what's wrong with me.",
                " I don’t know, I feel a little confused and disoriented to be honest.",
                " Oh, I see. Do you know when I'll be able to go home?",
                "  Thank you for coming to visit me, it's always nice to see a friendly face.",
                " of course. Are you feeling scared or afraid? (9)",
                " I understand. Can you tell me more about how you are feeling? (9)",
                " Hiking in the mountains? I'm afraid I don't remember that.",
                " Oh, not so good. I feel a bit confused.",
                "  Well, I used to love sewing and painting. But I'm not sure if I still do those things, my memory isn't what it used to be.",
                "  I don't know, everything is so confusing.",
                "  Oh, I see. But what's going on exactly? What's wrong with me?",
                "  I don't really know, I haven't seen the leaves change colors in so long.",
                " Oh, not so good. I'm feeling confused.",
                " Well, I must admit that I'm feeling a bit nervous. But I know I have my family and my faith to help me through this.",
                " I am not sure why I am here or what's happening. It's a bit scary. ",
                "  I don't feel like I've been here that long.",
                " Oh, I love to knit and read, dear. And sometimes I like to take long walks too.",
                " No, I don't. Did we have fun?",
                "  Can you tell me what's happening?",
                "  No, I feel okay. ",
                " Oh, I see. I hope I get better soon.",
                "  I feel afraid. Can you stay with me for a while?",
                " I'm not scared, but I do feel confused sometimes. I don't remember things like I used to.",
                " (9) Are you feeling scared? Afraid? Tell me more about how you are feeling.",
                " The beach? Oh yes, I remember. We had so much fun building sandcastles and watching the waves.",
                " Yes, I love reading. It's one thing I still enjoy doing. ",
                "  Okay. Sometimes I feel scared and don't know what's going on. What do I do then?",
                "  I hope I get better soon.",
                " Sometimes, when I can't remember anything. It's like I'm lost.",
                "  (with tears in her eyes) Yes, sometimes I feel so scared. I don't know what's happening to me. I'm forgetting everyone and everything I used to know.",
                "  Sick? I don't feel sick. Are you sure about that?",
                "  I don’t know, I just feel confused and lost.",
                "  I don't know. I feel like something is not right though. ",
                " I'm feeling a bit scared right now. What's going to happen to me?",
                " Sick? I'm not sick, I feel perfectly fine.",
                "  Oh, that's right. I hope I feel better soon.",
                "Dimentia  Hmm... let me think. I have two children.",
                " Oh, hello there. I'm feeling a bit confused, to be honest.",
                " Oh, I see. I'm not feeling well?",
                "  I used to love knitting and playing the piano. But I haven't done either in a long time. ",
                "  I'm feeling a little scared. Can you stay here with me for a while?",
                " Sometimes I feel like I'm lost and alone. It scares me.",
                " Well, I used to love gardening and reading. I don't do much of that anymore, though.",
                " Yes, I feel very confused and scared. ",
                " Oh, I am? I can't really remember why I'm here. What's wrong with me exactly?",
                "  I just feel so confused and lost.",
                " Sometimes I feel a little confused and scared, but mostly I'm okay.",
                " I don't really know. I feel like I've lost something, but I don't know what.",
                " Sometimes I do feel scared, but I'm not sure why. It's just a strange feeling.",
                "  I hope they're all doing well. I feel so scared and alone here.",
                " I used to live in the house down the street, but I don't think I live there anymore. I'm not quite sure where I am now.",
                " Sometimes I do feel a bit afraid. It's scary not being able to remember things like I used to.",
                " I'm not sure, I feel a bit confused and disoriented.",
                "  Yes, that was so much fun.",
                " I am feeling a bit scared. I don't like not knowing what's happening to me.",
                "  I don't know, I just feel so confused and lost.",
                " Yes, I do. But Grandma, are you feeling scared or afraid about anything? Please tell me more about how you are feeling. (9)",
                " Is that where I am? I didn't recognize the place.",
                " No, not really. But I'm just confused about everything. Do you like to read? (10)",
                "  I don’t remember.",
                "  To be honest with you, I'm feeling a bit confused and disoriented. It's a scary feeling.",
                "  Yes, I am. I don't know what's happening to me.",
                "  Yes, I remember now. I used to love nothing more than spending hours in the garden. Thank you for reminding me.",
                "  Oh, I see.",
                " 2021? My, how time flies. (pauses) I'm feeling a little scared. Can you hold my hand?",
                " I don't know. I just feel confused and disoriented.",
                " (pauses) I'm not too sure...I used to love knitting and baking. ",
                " (sighs) It's all becoming a blur now... ",
                " Am I really? I couldn't quite remember.",
                " Oh my goodness, time really does fly. Thank you for reminding me.",
                "  I have two children, a son and a daughter. They're both amazing, you know.",
                " Am I? I don't remember why I'm here. ",
                " Am I going to be okay?",
                "  Can you take me home now? I don't like it here. ",
                "  Do you think I will get better soon?",
                " <looking anxious> I don't know...something just feels off. Like I'm not quite sure what's going on.",
                " Sick? What's wrong with me?",
                " Sick? What's wrong with me?",
                " Yes, I don't know what's happening to me."
            ],
            "repsonses": [
                "(16) You must be feeling very scared right now. "
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "(17) Tell me about your friends in school.",
            "patterns": [
                "  Can you tell me about your life?",
                "  (tearfully) Thank you.",
                " Yes, I am. But I know I have my family and my faith to help me through this.",
                " Oh, that must mean it's my birthday! I can't wait to blow out the candles on my cake.",
                " (4) Do you remember the time when we went on a family vacation to the beach?",
                " Do you think I'll ever get better and remember things again? ",
                "  Yes, I am.",
                "  Oh, that's right. I always liked <season>.",
                "  A little bit, yes.",
                " Thank you. ",
                " ",
                " Yes, I am.",
                " Yes, I do. But right now, I just want to spend time with you. You must be feeling very scared right now. (16)",
                "  I don’t remember anything anymore.",
                " I used to paint a lot, but I haven't done that in a while. I can't seem to find my supplies. ",
                " (confused) Reading? I can't seem to remember the last book I read. ",
                " <nods> Yes, I suppose I am. But it's alright, you're here with me."
            ],
            "repsonses": [
                "(17) Tell me about your friends in school."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "(18) Tell me about your children. ",
            "patterns": [
                "  Oh yes, I remember that. We had so much fun, didn't we?",
                "  Yes, I remember that. We had so much fun.",
                " I have two. A boy and a girl.",
                " I think it's winter.",
                "  His name is John. We've been married for 45 years. ",
                "  Oh, yes! I remember when my children were little and we used to go on family picnics. Those were such happy times.",
                " I can't remember.",
                "  I have... I have two children. A son and a daughter. They were both such wonderful kids. ",
                " His name was Jack. We were married for 50 years.",
                "  I wish I could remember it better. But I'm grateful for the memories we do have.",
                " Hmm, let me think. Oh, when my grandchildren would come to visit, we would always bake cookies together. Those were simpler times.",
                " I'm sorry, I just can't seem to remember right now.",
                "  Is it summer? I love swimming in the ocean and building sandcastles.",
                "  I don't know, that's why I'm asking.",
                " Yes, I have two. ",
                "  Oh, it was such a lovely trip. I miss those days.",
                " Oh, yes! I remember when my children were little, we used to go on picnics in the park.",
                " Oh yes, I remember that. They loved it when I read to them.",
                "  Oh yes! I remember that. We had so much fun playing in the sand and swimming in the ocean.",
                " Three! Two boys and a girl.",
                " I don’t know. I feel like I’m forgetting something important.",
                "  I live in the house with the blue door, by the big tree.",
                "  I don't know.",
                "  I think I have two children, a boy and a girl.",
                "  Oh yes, I remember when I used to go fishing with my dad. We would always catch so many fish!",
                " Vacation? Oh, I don't know if I remember that.",
                " A little bit, I suppose. Who are you again?",
                " Yes, I am. I don't know why I'm here or what's going on.",
                " Yes, I am a little scared. Can you stay with me for a while?",
                " Oh, yes! I used to read all the time.",
                " Oh, it was so much fun. We played in the water and built sandcastles. How many children do I have again?",
                " Yes, my husband's name was John.",
                "  (pauses, then shakes head) I can't remember.",
                "  Yes, his name is John.",
                "  Yes, I remember having picnics with my family in the park.",
                " I have three lovely children.",
                " I'm not sure. Can you remind me?",
                " My spouse? Why, yes, of course. Their name is...it's on the tip of my tongue. ",
                "  Can you tell me about my family?",
                " Let me think... I believe I have two children. A son and a daughter.",
                " Spouse? Yes, I do have one. But I can't seem to remember their name right now.",
                " Oh, right. It must be spring then.",
                " Vacation? Oh, yes, I remember that. We had so much fun.",
                " Yes, that was so much fun! We all went swimming in the ocean and built sandcastles on the beach.",
                " I have three kids. They're all grown up now.",
                "  Oh good, I always loved winter time.",
                " Oh, how could I forget! It was so much fun gliding on the ice with you.",
                "  Three children. Two girls and one boy.",
                " Oh yes, those were such happy times. I miss them.",
                "  June 10th... that doesn't ring a bell. But thank you for letting me know.",
                "  Wait, don't go. Can you tell me about my children? How many do I have?",
                "  Oh, I have two. A boy and a girl. But I haven't seen them in quite some time. ",
                " 2021... It's been a long time. Do I have any children? (5)",
                "  I have two children, a son and a daughter. They're both so amazing.",
                " Yes, I remember when we all went on a family picnic last summer. It was such a lovely day.",
                " Yes, I remember that. It was so much fun.",
                " Oh, I have three children. They're all grown up now.",
                " I have children? I can't remember. ",
                "  I'm not sure.",
                " Well, let me see. I have three, dear.",
                " Oh, I see. Do I have a family?",
                "  Oh, I remember when we used to go to the beach every summer. Those were such fun times.",
                "  I'm not sure...can you remind me?",
                " I have two children, a boy and a girl.",
                " Oh yes, I do. That was such a fun day. I miss those gatherings.",
                "  Oh dear, I can't seem to remember.",
                "  I used to love gardening and painting. But I haven't done that in a while.",
                " Do you have any children? How many do you have?",
                " Oh, I have quite a few... let me think... (pauses) I'm not sure I can remember right now.",
                " Yes, I love to read. I used to be able to read all day, every day.",
                " Oh, okay. ",
                "  Oh, okay. I don't remember that.",
                " Oh, I have three lovely children. They used to visit me all the time, but lately I haven't been able to see them much.",
                "  I had a lot of friends in school. We used to play games during recess.",
                " Oh hello! I'm doing fine, thank you. Who are you?",
                " I have children? I can't remember their names.",
                "  I made some good friends in school. We used to hang out and talk about music.",
                " Oh yes, I remember that. That was so much fun.",
                "  Yes, it's winter. I used to hate the cold, but now I don't mind it so much.",
                "  Hawaii? I don’t remember that.",
                "  Oh, thank you for telling me. It's nice here.",
                "  Yes, my husband. His name is John. ",
                " The beach? I love the beach! ",
                " Oh, that was lovely. We had such a great time.",
                " Oh hello, I don't quite remember you. Who are you?",
                "  Oh, I had so many friends in school. We used to play together all the time.",
                " Oh yes, we used to dance to all the big bands. We looked so good together!",
                "  I'm not quite sure. Can you remind me?",
                "  Yes, please. ",
                "  Two, right?",
                "  Hawaii? Oh, yes! It was beautiful there. The beaches and the palm trees... what a wonderful trip that was.",
                " I can't seem to recall, can you remind me?",
                "  Three, right? Can you tell me their names?",
                " Oh yes! That was so much fun.",
                " Oh, I have two sons and a daughter. They're all grown up now.",
                "  I have two children, I think. A boy and a girl. Are they here with me?",
                " Oh, right. Thank you for reminding me.",
                " Oh, I had a friend named Sarah. We used to play hopscotch together during recess. ",
                "  Yes, that was so much fun. We built sandcastles and collected seashells.",
                " Oh, they were all so lovely. We used to have picnics in the park and talk about books we'd read.",
                " I'm not sure, maybe two?",
                " Oh, I see. Time seems to be passing by so quickly these days.",
                " I'm not sure. Can you tell me?",
                " Oh, I remember that so clearly. It was such a fun time.",
                "  How is the family doing? Have you seen my children?",
                " I'm not quite sure... Do you know?",
                " I'm sorry, I can't quite remember. Could you remind me?",
                " I have two wonderful children. I'm so proud of them.",
                " Oh yes, I remember when my children were little and we used to go on picnics in the park. Those were some wonderful times.",
                "  Oh, I thought it was still the 80s.",
                " I have three children, two boys and a girl. They used to visit me a lot, but I haven't seen them in a while. ",
                " 2021? That can't be right. I remember it being the 1950s.",
                " Hawaii? When did we go there? ",
                "  I have two children, a son and a daughter.",
                "Grandma: I sure did. And did you say how many children I have? (5)",
                " Actually, I don't feel scared. I just feel lost.",
                " I remember playing with my grandchildren during the holidays. They were so much fun to be around.",
                " I don't know about scared, but everything is just so unclear. Can you tell me more about my friends in school? (17)",
                "  I don’t know.",
                "  Of course! We built a big sandcastle together. Those were good times.",
                "  Oh, that was a wonderful day. I miss those times.",
                "  I used to live in a big house with a beautiful garden. I can't quite remember where it was.",
                " I remember picking strawberries in the summer with my grandchildren. Is that what you're talking about?",
                " (confused) Spouse? I don't remember having one. ",
                " I'm not sure if I'm scared, but I am feeling a bit lost and unsure.",
                "  I used to live in a big house with a garden. But now, I can't remember.",
                "Grandma: Oh, dear. I'm so sorry, I must have forgotten. Do I have any children? (5)",
                " I'm not sure, I feel a bit confused and disoriented. ",
                " Yes, I am terrified. Who will take care of me?",
                "  I remember playing outside with my siblings.",
                "  Yes! My children and grandchildren came to visit me. We had so much fun together.",
                " <pauses> I don't think I can remember them off the top of my head.",
                " I have two children. A boy and a girl.",
                " Yes! I always loved going to the beach with you.",
                "  Yes, I do have a spouse. His name is John, I think.",
                " No, I'm sorry. ",
                " Oh yes! We had so much fun, didn't we? The sand, the waves, the sunshine... "
            ],
            "repsonses": [
                "(18) Tell me about your children. "
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "(19) Okay.",
            "patterns": [
                " Oh, I see. Yes, it does feel like summer.",
                "  Yes, my husband. His name is John. Is he here with me?",
                "  I used to love to garden and cook, but I don't remember doing them anymore. ",
                " Sick? What's wrong with me?",
                " Yes, his name is John. Do you know where he is?",
                " I'm feeling a bit cold. Can you get me a blanket?",
                " I'm feeling tired. Can I go to sleep now?",
                "  I have no idea. Does it matter? ",
                "  I'm a bit confused, but not really scared. I know I'm in good hands here.",
                " Yes, I am. Can you stay with me until I feel better?",
                " Thank you for visiting me. It's nice to have company.",
                "  Am I going to be okay?",
                "  Yes, I do. Their name is John. Do you know him?",
                "  I'm not sure. Can you remind me?",
                "  Yes, I am. Will you stay with me?",
                "  Oh hello, I'm doing alright, thank you! How about you?",
                " Oh, hello! I'm doing alright. How are you?",
                "  At home, I think. But I'm not sure where exactly. Do you know?",
                " I'm not sure. Could you tell me? ",
                " Yes, I do. His name is... hmm, it's on the tip of my tongue.",
                "  Oh, I see. What am I sick with?",
                "  Oh, I used to love gardening and painting. But I don’t do that anymore.",
                "  His name is John.",
                "  That's a long time from when I was born.",
                "  That would be nice. Thank you. (20)",
                "  I have two daughters. They are both so beautiful.",
                " Oh, I'm doing just fine. How about you?",
                " I am a little scared. I don't know what's happening to me.",
                " Oh, how lovely! I always enjoy winter, don't you?",
                " Well, I loved the scenery and the food. And most of all, I loved spending time with you and the rest of the family. It was such a wonderful time.",
                " I love making soups and stews, especially in the winter. They're so comforting and delicious.",
                " I'm not quite sure. Can you remind me?",
                "  No, I'm not scared. But I do feel a bit confused and disoriented.",
                " I used to love reading. Do you have any books with you?",
                " A little bit. I wish I could remember things better. ",
                "  Am I going to be okay?",
                "  Yes, I think I am.",
                "  Am I going to get better?",
                "  Can you help me understand what's happening?",
                "  I don't know...sometimes I feel confused and don't understand what's happening. But I'm not really scared.",
                "  No, not really. I'm just a bit confused and forgetful sometimes.",
                " I'm not sure. Can you tell me?",
                " Oh, yes! We went to the beach, didn't we?",
                " Sometimes I do feel scared. I don't always remember where I am or what's going on. But I'm glad you're here with me.",
                " I don't think so. But everything feels so confusing.",
                "  They're all grown up now. ",
                "  Sick? What's wrong with me?",
                "  Oh, hello there! I'm doing just fine, thank you. How are you?",
                " Oh, I have four lovely children. Where are they now?",
                " Oh, hello! I'm doing well, thank you. How about you?",
                " I used to bring my favorite sandwiches and we would sit on the grass and watch the birds fly by.",
                " Oh, I have a son and a daughter. They're both doing really well. Do you know where they are right now?",
                " Yes, sometimes I am. But talking to you makes me feel better. Thank you for visiting me. ",
                " I don't quite feel anything at the moment. Is that normal?",
                " Oh, I see. Do I have to stay here long?",
                " His name is John, but I haven't seen him in a long time.",
                " Oh, that was such a lovely day! It's been a while since I've seen them.",
                " Thank you for visiting me today. You're such a dear.",
                "  No, I don't think I do. Did we have fun?",
                "  Oh. Am I going to be okay?",
                " Oh, I see. How long have I been here?",
                " You must be feeling very scared right now. (16)",
                " I'm doing okay, thank you. How about you?",
                " I used to love gardening and reading books, but I can't remember if I still do those things.",
                " Oh hello, I'm doing alright. How about you?",
                " Is it really? Time seems to have flown by.",
                "  I have two, a son and a daughter. Do they ever come visit me here?",
                "  I think I have two, or maybe it was three? It's hard to remember.",
                " I do feel a little scared sometimes, not quite sure why. But it's nice to have someone here to talk to. Thank you for visiting me.",
                " It is fall now. (13)",
                " I can imagine how scary that must be. (20)",
                " I suppose I am a bit scared. I don't know what's wrong with me, and I don't like being away from home.",
                "  Yes, I am a bit scared. I don't know where I am or what's going on, but it's reassuring to have someone here with me.",
                "  Oh, yes! That was so much fun. I miss those times.",
                " Okay. Today is July 14th. (11)",
                "  I'm trying not to think about it too much. I'm just happy to see you here with me. ",
                " Oh, hello! I'm doing alright, thank you. How about yourself?",
                " Oh my, that was such a long time ago. I don't quite remember any of my friends from school.",
                " I used to love reading, but it's hard for me now. ",
                "  Am I going to be okay?",
                " My best friend was Mary, but she moved away years ago. I wonder where she is now.",
                "  Okay. ",
                "  I am? I didn't even know I was sick. What's wrong with me?",
                "  I used to enjoy gardening and painting. Do I still do those things?",
                " Sometimes I am scared. I don't always remember where I am or what's happening. But it helps to have visitors like you. Thank you for being here with me. ",
                "  Can you tell me something? What's your name?",
                "  I used to love gardening and painting. Do you like gardening?",
                "  I'm not sure. Can you remind me?",
                " Oh, okay. How long do I have to stay here?",
                " (16) Oh, yes. I am feeling quite scared right now. I don't know what's happening and it all seems so confusing. ",
                " Yes, I am confused and scared. Everything is so unfamiliar to me. ",
                "  Fishing? I don't remember fishing. Did we go fishing?",
                " Oh, hello there! I'm doing quite well, thank you for asking. How are you?",
                " Oh, I must have forgotten. Thank you for reminding me. Do I have any visitors coming to see me soon?",
                "  Oh okay, thank you for telling me. You know, you're such a nice person.",
                "  My son is a doctor and my daughter lives in another state. I miss them both so much.",
                "  Honestly, I am a little scared. I don't like being in the hospital, but I'm glad you're here with me.",
                " July 20th...that doesn't mean anything to me.",
                "  I'm sorry, I can't seem to remember their names. But they were always so kind to me.",
                " Oh no, that's not good. What's wrong with me?",
                " Are you sure I have children?",
                "  (long pause) Yes... yes, I remember. We would spend hours splashing around in the cool water.",
                " Oh, I used to love painting and gardening.",
                " Oh yes, that was a wonderful trip. We saw so many beautiful places.",
                " Oh, I see. Do you happen to know what's wrong with me?",
                " John. John Smith. Do you know him?",
                " Yes, I am. Can you stay with me for a while? ",
                " I'm sorry, I feel like I'm being difficult.",
                " A picnic? I'm not sure I remember that, but it sounds like it was a nice time.",
                "  My children are wonderful. They always make me proud.",
                "Dimentia  Yes, I am. I don't know what's happening to me.",
                "  (Silence)",
                "  I loved reading mysteries.",
                " Yes, I am feeling scared. I don't know what's going on or what's going to happen.",
                " Yes, I feel very confused and disoriented.",
                " Two, a boy and a girl. What are their names again?",
                "  Oh, hello! I'm doing fine, thank you. How are you?",
                "  Well, one of them was a doctor. And the other two were always so creative. They used to make me the most beautiful drawings. ",
                "  Oh, not too bad. How about you?",
                "  Oh, I see. Thank you for coming to visit me. ",
                "  I used to live in a big house just down the street. But now I can't quite remember where I live. Do you know?",
                " I used to, but it seems like such a task now. I just can't seem to focus. You must think I am forgetful.",
                "  Oh, I see. I hope it's not serious.",
                "  I used to love playing the piano and gardening. Do we still have a piano at home?",
                "  Honestly, I have been feeling a bit confused lately. I don't always know what's going on around me and it's frustrating. But I'm not scared, I know I'm in good hands here.",
                " Sick? What's wrong with me?",
                " Yes, I am.",
                " A little bit, yes. But it's nice to have visitors like you to keep me company.",
                " John is a doctor and Kate is a teacher. They both live far away from me. ",
                " Oh hello there! I'm doing alright. How about you?",
                " Oh, hello dear! I'm doing just fine, thank you for asking. How about yourself?",
                "  Yes, I am. I don't know what's happening to me.",
                "  Yes, we had sandwiches and lemonade... and I remember we saw a butterfly.",
                " Oh, I see. I hope they can help me get better.",
                " My oldest is a doctor now, and my daughter is a teacher. They always made me proud.",
                " Oh, I see. Is it serious?",
                " Actually, I do remember enjoying knitting when I was younger.",
                "  Oh, that's right. I forgot. Do you know when I can leave?",
                "  Oh yes! That was such a fun day. The sun was shining and the water was so warm.",
                "  Yes, his name is Richard.",
                "  I just feel confused and disoriented most of the time. I can't remember things and it makes me feel frustrated.",
                " Oh hello, dear! I'm doing just fine. How about you?",
                " Ah, yes. I love them both so much. Where are they now?",
                " Yes, it's a frightening feeling not being able to grasp onto memories like I used to.",
                "  I am a little scared. I don't know why I'm here or what's going on.",
                " I don't have any grandchildren, do I?",
                " Winter? I used to love playing in the snow with my children. ",
                "  I used to love knitting and baking, but I don't do much of that anymore.",
                "Grandma: Actually, I am a little scared. I'm not sure what's going to happen next. (16)",
                "Grandma: Oh, alright. Thank you for visiting me today. It was nice to see you. (20)",
                " My daughter is a doctor and my son is a teacher. They're both doing really well.",
                " Sometimes, I feel lost and confused. Like I'm not fully here. It scares me.",
                "  Am I going to be okay?",
                "  Her name is Mary.",
                "  I don't remember any of my friends. ",
                " Sometimes I feel scared, like I'm losing my mind. But I know I have loved ones who care for me.",
                "  Oh hello dear, I'm doing just fine. How about you?",
                " Sometimes I do feel scared, like I don't know what's happening to me. It's all so confusing.",
                "  Well, I'm a bit confused and not sure what's going on. But I feel safe with you here.",
                "  I am a bit scared, but having you here by my side makes me feel much better. Thank you for coming to see me.",
                "  I'm just worried I won't remember anything soon.",
                " Well, we used to pack sandwiches and fruit, and sit under the big tree by the lake. It was so peaceful.",
                " Yes, I think I am.",
                " (pauses) Actually, now that you mention it, I do feel a little scared. It's strange being in the hospital. ",
                " (getting emotional) My school friends were the best. We used to have so much fun together. ",
                " Well, I used to love knitting and baking. But I'm not sure if I still do those things now.",
                " Oh hello dear, I'm doing just fine. How are you?",
                "  Well, I used to love gardening and playing piano. But I don't think I've done that in a while.",
                " Yes, I am very scared. I don't know what's happening to me. ",
                " I see, I see. Thank you for telling me. You know, you're such a kind person. I'm so grateful to have you as my family. ",
                "  I used to enjoy gardening and cooking.",
                " <smiling> Oh, my children are wonderful! They always make me so proud.",
                " Yes, I am. I don't understand what's happening.",
                "  I used to enjoy puzzles and knitting, but it's been a while since I've done either.",
                " I'm so confused.. "
            ],
            "repsonses": [
                "(19) Okay."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "(20) Mhhm",
            "patterns": [
                " The beach? Oh, I love the beach! Tell me more.",
                "  I'm feeling a bit tired now. Will you stay with me for a little while longer? ",
                "  I have no idea. Can you remind me?",
                " My son's name is David and my daughter's name is Sarah. David is a doctor and Sarah is a teacher.",
                " (4) Do you remember the time when we all went to the beach?",
                "  Vacation? Oh, I love vacations. Where did we go? ",
                " I used to love painting and gardening, but I don't think I can do that anymore.",
                "  Hmm, I'm not sure. Can you tell me more about it?",
                "  Oh yes, how could I forget! It was wonderful. The sand was warm and the water was cool. We saw so many beautiful creatures in the water. ",
                " Yes! It was such a lovely day. My grandmother would always tell me stories while we baked. Did you know she once met the president?",
                "  Vacation? Beach? Oh, that sounds lovely. Did we have a good time?",
                "  Do you know what happened to me?",
                "  Yes, I am. Can you hold my hand?",
                "  Oh, I had so many friends. We used to play together all the time.",
                " Not really. I just wish I could remember things better. ",
                " I know it can be scary to not remember things. Are you feeling scared or afraid? (9)",
                " That's understandable. Do you remember when we used to go camping together? (4)",
                " We would always take a hike and then make smores by the campfire. (4)",
                " Do you have any hobbies that you enjoy? (8)",
                "  I used to enjoy knitting, but I don't remember how to do it anymore. (20)",
                " It's okay if you don't remember how to do it. We can try and relearn together if you want. (20)",
                " Alright, well it was nice visiting you today. I'll come back soon, okay? (19)",
                " Oh, hello! I'm doing fine, thank you for asking. How are you?",
                " Thank you for visiting me. It's always nice to see a familiar face. ",
                " Thank you for visiting me. ",
                " Yes, his name is John. He should be here any minute.",
                "  I have two children. A boy and a girl. They used to come visit me. Where are they now?",
                "  Yes, his name was John.",
                "  Oh, thank you for reminding me. It's nice to have someone to talk to. ",
                "  I don't know what's real anymore. Everything is so confusing.",
                "  No, not really. I'm just a bit confused and forgetful sometimes.",
                " I wish I could remember things better.",
                " One time, we all went on a picnic by the lake. My children were so excited to go swimming that they didn't even eat their sandwiches. They just ran into the water and had a wonderful time.",
                " Well, my oldest son is a doctor, my daughter is a teacher, and my youngest son is a lawyer. They're all very successful, you know.",
                " I keep forgetting things and everyone looks unfamiliar. It's like I'm lost.",
                " I can't seem to remember... Do you know how many I have?",
                " Oh, hello dear. I'm doing fine. How are you?",
                "  (smiles) Okay.",
                "  I'm not sure... can you tell me more about it?",
                " I am scared, dear. Can you stay with me for a while? ",
                " Yes, I do! It was so much fun. The sun was shining and the water was crystal clear.",
                "  I used to love painting and playing the piano. ",
                " I think I have three children, but I can't remember their names.",
                " Season? I'm not sure. The weather outside seems nice though. ",
                "  Oh, I used to love painting and gardening. Do we still have a garden?",
                "  I don't know. I feel lost.",
                " Sometimes I feel a little unsure about what's going on around me, but I'm not necessarily scared. I just take things as they come.",
                " Yes, I am. But I'm glad you're here with me. Thank you for visiting. (19) ",
                " Fishing? Oh yes, that was so much fun. Do you remember the big fish we caught?",
                " Like I said, I can't quite remember. How many did I say before?",
                " Well, I feel a bit confused and disoriented. But overall, I'm just trying to take things one day at a time.",
                "  I just feel like I'm losing a part of myself, you know? It's hard to describe.",
                "  I'm just so confused and don't understand why I can't remember things anymore. It's scary. (16)",
                " I don't know. Do I have grandchildren?",
                "  Yes, a little bit. Who are you again?",
                "  I think I have two, right? Can you tell me their names?",
                "  Oh really? I'm sorry, it all seems like a blur to me.",
                " They are... I can't remember their names. ",
                " I am your granddaughter. Do you remember me? (4)",
                " Do you know where you are? (1)",
                " Your husband passed away two years ago. Do you remember him? (4)",
                " Do you have any children? (5)",
                " What are their names? (6)",
                " It's okay. Do you like to do any hobbies? (8)",
                " That's great! Do you remember what year it is? (2)",
                " It's 2021 right now. (12)",
                " Yes, time passes by quickly. Do you feel scared or afraid right now? (9)",
                " You're in the hospital right now, but we'll make sure to celebrate Thanksgiving together soon. (14)",
                " Oh, I see. I don't feel too sick, though. Do you know when I can leave?",
                " Will you stay with me for a while? ",
                "  His name was John, but I haven't seen him in a long time.",
                "  I remember when my children were little and we used to go for walks in the park.",
                " I'm not sure. I just feel confused.",
                "  Okay. ",
                "  I just feel lost and confused. And scared, like you said. I don't know what's going on.",
                "  Do you think I'll be able to go home soon? I don't like being in the hospital.",
                " (looks confused) I can't remember.",
                " Oh, hello there. I'm doing fine. How about you?",
                "  Am I going to be okay?",
                "  Thank you for visiting me. It's nice to see a familiar face.",
                " (3) Do you know what season it is?",
                " Thank you for talking with me. It's nice to have some company. ",
                "  I'm not sure. Can you tell me?",
                " Oh, I remember a time when we all went on a family vacation to the beach. We had so much fun building sandcastles and swimming in the ocean. It was a truly beautiful time.",
                " Thank you, that means a lot to me. Is there anything else you want to talk about or share with me? (19)",
                "  Alright.",
                " No, I don't feel scared. Why should I be scared? I'm perfectly fine.",
                "  So, how are you doing? How's your family?",
                " Yes, my husband's name was Frank.",
                "  Thank you for visiting me. It's nice to talk to someone. ",
                " I don't think I have any.",
                "  Sick? What's wrong with me?",
                "  Oh, hello dear. I'm doing alright. How about you?",
                "  I used to enjoy playing the piano and gardening, but I can’t seem to remember how to do either now.",
                " What are we doing here, anyway? Did I come to visit someone?",
                "  I have... two children, I believe. A boy and a girl. They are wonderful.",
                "  Two. A boy and a girl. ",
                " Fall? I love the changing leaves. ",
                " Painting and drawing. I was quite good, you know.",
                " I can't remember.",
                "  Alright.",
                "  (Silence)",
                " His name is Jack. Do you know him?",
                "  Hobbies? Well, I used to love gardening and reading books. Do you like to read?",
                "  Three wonderful children. But I can't quite remember all their names. ",
                "  Yes, her name is Mary. ",
                "  Well, my oldest son's name is Michael and my youngest daughter's name is Sarah. Aren't they lovely?",
                "  Oh, hello there! I'm doing well, thank you. How are you?",
                " Thank you for stopping by. You've been kind to put up with me. ",
                "  Oh, yes! We went to Hawaii and had the best time. Did you like it too?",
                "  Thank you, dear. It's nice to have you here. ",
                " Do you know where my family is?",
                " Thank you for visiting me.",
                "  It feels like it's summertime. Is it? (13)",
                " Sick? What's wrong with me?",
                " I know, and they love you very much. Okay, well, it was lovely talking with you. (19) ",
                " Let me see...ah yes! I remember one time when I was a little girl and my mother baked the most wonderful apple pie. The aroma filled the whole house and we all sat down together to enjoy it.",
                " Yes, I do have a spouse. His name is...oh, what is his name again? It's on the tip of my tongue.",
                "  I do have a spouse. Their name is... I can't seem to remember right now.",
                "  I'm not sure... what town?",
                "  I used to love reading books. Do I still read?",
                " Thank you for visiting me. It's nice to have someone to talk to. ",
                " Thank you for visiting. ",
                " Wait, who are you again?",
                " Hmm, I'm not quite sure. What do you like to do for fun?",
                " I'm not sure, could you remind me?",
                "  I have three children. Their names are John, Sarah, and Emily. Do you know where they are?",
                "  Is Richard with the children?",
                " Well, I have two children. A boy and a girl. They're both so wonderful. Do you know their names?",
                "  Three. Sarah, David, and...I can't remember.",
                " Sometimes I do feel scared. I don't really know what's going on, and it can be overwhelming. But I'm just trying to take things one day at a time. ",
                " Who are you again? ",
                "  My son is a doctor and my daughter is a teacher. They both live far away, but they come to visit me sometimes.",
                "Grandma: Ah, I remember summers when I was young. Do you remember the time when we went to the beach and caught crabs? (4)",
                "Grandma: That's right. And do I have a spouse? What is their name? (6)",
                "Grandma: Thank you dear, that means a lot to me. Today is... (11)",
                " Today is July 15th, Grandma. (20)",
                " Thank you for visiting me. It's always nice to have some company. ",
                "  I don’t know.",
                "  Hmm, let me think. I have two children, don't I?",
                " Thank you for coming to visit me, it's nice to have some company. ",
                "  Maple Street... I can almost picture it now. Thank you for being here with me, it means a lot.",
                " Oh, hello there! I'm not sure how I'm doing today. Can you tell me your name?",
                "  Yes, I do have a spouse. Their name is on the tip of my tongue, but I can't quite remember.",
                " What year is it? This whole thing feels so strange.",
                " (pauses) Yes, with the sand castles and ice cream, right? ",
                " (tearfully) I'm just scared I won't remember anything one day... ",
                " A little bit, dear. I'm not quite sure what's happening, but I know I'm in good hands with the doctors and nurses here.",
                "  Can you please take me home now? I don't like it here.",
                " I'm not sure, sorry. ",
                " No, no. I'm feeling quite tired now. I think I need to rest. ",
                "  Yes, I am. Please take me home. ",
                "  I used to love knitting and gardening. But I can't remember the last time I did either of those things.",
                " Okay. (19)",
                " The beach? I'm not sure.",
                " Ah, that's right. They're both grown up now, aren't they?",
                "  Did you bring any books with you? I feel like reading.",
                " I'm sorry, I don't know what date it is. ",
                " I have three children - two boys and a girl. They are all grown up now, but I remember when they were just babies... "
            ],
            "repsonses": [
                "(20) Mhhm"
            ],
            "context": [
                ""
            ]
        }
    ]
}